doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.org
#+title: Two sugars with your Contracts for Clojure Maps
#+tags: clojure map accessor aspect contract
#+options: H:4 toc:2
#+options: ^:{}
#+STARTUP: hidestars
#+TAGS: noexport(e)
#+EXPORT_EXCLUDE_TAGS: noexport
#+OCTOPRESS_CATEGORIES: clojure map aspect contract
#+OCTOPRESS_COMMENTS: testing ox-md-octopress
#+PROPERTY: :mkdirp yes
#+BEGIN_QUOTE
TL;DR: Using Getters and Putters with Contracts on Clojure Maps
#+END_QUOTE
* Introduction

[Maps][HashWikipedia] are pervasive in many programming languages. As  [Fogus][FogusHome] and
[Chris Houser][ChouserHome] observe in their book [The Joy of Clojure][BookJoC2ed] (section 5.6):

#+BEGIN_QUOTE
It’s difficult to write a program of any significant size without the
need for a map of some sort.

The use of maps is ubiquitous in writing software because frankly it’s
difficult to imagine a more robust data structure.
#+END_QUOTE

Maps  have been around quite a while.  In their book [Introduction To
Algorithms][CormenBookIntroductionToAlgorithms] _Cormen et al_ say Donald Knuth
[attributed][CormenBookIntroductionToAlgorithmLuhn] the invention of
maps to [Hans Peter Luhn][LuhnWikipedia] in early 1953.

Using [maps][HashWikipedia] is very natural and easy in
[Clojure][ClojureHome] and indeed many other languages that support
them. Clojure takes [Alan Perlis's][PerlisTuringAward]
famous quote to heart by providing a rich set of functions to manage maps:

#+BEGIN_QUOTE
It’s better to have 100 functions operate on one data structure than 10 functions on 10 data structures.
#+END_QUOTE

One of the [Clojure][ClojureHome] projects I've been working on uses
multi-level (hierarchical) [maps][HashWikipedia] i.e. the values of the keys of a map at one level are often maps
themselves. 

But using deep (multi-level) maps with many levels and many keys with long-ish
descriptive names can make the code look very cluttered and prone to
typos, misremembered key names, juxtaposition of levels, and similar,
often _silent_, errors as e.g. _get_ and _get-in_ will return a
value (nil) rather than raising an error, and _assoc_ and _assoc-in_
wont care at all.

Its very easy in [Clojure][ClojureHome] to write function(s) to encapsulate
the accesses to a key's value, especially for multi-level keys, creating
"helper" _putter_ and _getter_ accessors. 

Arguably, maybe  a stretch, you could think of these accessors as
[_higher order_][HigherOrderFunctionWikipedia] functions where the (implicit) input functions are e.g.
_get_ or _assoc_.

For example, and as usual a contrived example, where a deep multi-level map
holds all the details of a house:

#+BEGIN_SRC clojure :tangle no
(defn change-kitchen-temperature
  [house-state new-temperature]
  (assoc-in house-state [:rooms :kitchen :properties :temperature] new-temperature))
#+END_SRC

#+BEGIN_SRC clojure :tangle no
(defn install-kitchen-oven
  [house-state new-oven]
  (assoc-in house-state [:rooms :kitchen :appliances :cooking :oven] new-oven))
#+END_SRC

Which is nice (at least to me): semantically named accessors hiding
the details of the key hierarchy.  If the hierarchy needs to change for
any reason, only the accessor functions have to be changed.  A familiar enough
paradigm from many languages.

The other thing I've wanted to do in the project  has been
to apply  [contracts][Eiffel Design by Contract] to the _leaf_ values in the map. You could
of course just use an [_assert_][ClojureDocsAssert] to apply a contract to a value in "open code".
But that means the contract definition (i.e. assertion clause)
is scattered over the code base, hard to change, inconsistency may
creep in, etc.

[Fogus's][FogusHome]
[clojure.core.contracts][ClojureCoreContractsGithub] library uses
[Clojure's][ClojureHome] [:pre and post
assertions][FogusBlogClojurePreandPost] to apply contracts to a
function's arguments and/or its result (return value). 

In my recent [sugar post][RumfordBlogClojureContractsSugar] on contracts, I demonstrated a
new library I've written
[clojure-contracts-sugar][ClojureContractsSugarGithub] to add some
productivity macros ("sugar") atop [Fogus's][FogusTwitter] [library][ClojureCoreContractsGithub].

In a nice bit of synergy, if you use _putter_ and _getter_ accessors
for a map's _leaf_ values, you can apply also contracts to them.

Enter my new library: [clojure-contracts-maps][ClojureMapAccessorsGithub] 

#+BEGIN_SRC
<!-- more -->
#+END_SRC


* A quick summary of clojure-contracts-maps

Apart from the ability to apply rich contracts to the _leaf_ values,
the new library support some other features.

One feature useful to have is the opportunity to transform _map_ a
key's value.
In the case of a getter, the _mapper_ is applied *before* the value is
returned effectively returning a _view_ of the value.  In the case of a _putter_,
the _mapper_ can e.g. normalise the value in some way *before* the map
is "updated".

Its also useful, in a _getter_,  to support static and (per call) dynamic defaults for the key's
value.

You may also want to _monitor_ a key's access, especially when it
changes, and have a unique error message - a _telltale_ - when a value
fails a contract.


