doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Two sugars with your Contracts for Clojure Maps</title>
<!-- 2014-03-19 Wed 17:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Ian Rumford" />
</head>
<body>
<div id="content">
<h1 class="title">Two sugars with your Contracts for Clojure Maps</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. A quick summary of clojure-contracts-maps</a></li>
<li><a href="#sec-3">3. A few notes</a></li>
<li><a href="#sec-4">4. The Code</a>
<ul>
<li><a href="#sec-4-1">4.1. Jar is on Clojars</a></li>
<li><a href="#sec-4-2">4.2. Code is on Github</a></li>
<li><a href="#sec-4-3">4.3. Tests</a></li>
<li><a href="#sec-4-4">4.4. Examples</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Getters with Simple Contracts</a>
<ul>
<li><a href="#sec-5-1">5.1. Example - a getter for a key with a numeric value</a></li>
<li><a href="#sec-5-2">5.2. Example - a getter using static and/or dynamic defaults</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Putters with Simple Contracts</a>
<ul>
<li><a href="#sec-6-1">6.1. Example - a putter for a key with a numeric value</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Using a telltale to aid diagnosis of assertion errors</a>
<ul>
<li><a href="#sec-7-1">7.1. Example - a getter with a telltale</a></li>
<li><a href="#sec-7-2">7.2. Example - a putter with a telltale</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Contracts for Keys with multiple constraints</a>
<ul>
<li><a href="#sec-8-1">8.1. Example - a getter for a positive numeric key value</a></li>
<li><a href="#sec-8-2">8.2. Example - a getter to ensure a key's value is a map with keyword keys and numeric values</a></li>
<li><a href="#sec-8-3">8.3. Example - a getter with a custom predicate</a></li>
<li><a href="#sec-8-4">8.4. Example - a getter with a custom mnemonic for the key</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Contracts for the Map</a>
<ul>
<li><a href="#sec-9-1">9.1. Example - applying a contract to the map itself</a></li>
</ul>
</li>
<li><a href="#sec-10">10. Using Transformation Functions (mappers)</a>
<ul>
<li><a href="#sec-10-1">10.1. Example - putters with mappers</a></li>
<li><a href="#sec-10-2">10.2. Example - getters with mappers</a></li>
</ul>
</li>
<li><a href="#sec-11">11. Using a Monitor</a>
<ul>
<li><a href="#sec-11-1">11.1. Example - a getter with a monitor</a></li>
<li><a href="#sec-11-2">11.2. Example - a putter with a monitor</a></li>
</ul>
</li>
<li><a href="#sec-12">12. Multi-Level Keys</a></li>
<li><a href="#sec-13">13. Composing Multi-Level Accessors</a></li>
<li><a href="#sec-14">14. Defining both putter and getter</a></li>
<li><a href="#sec-15">15. Final Words</a></li>
<li><a href="#sec-16">16. Final, Final Words</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
One of the [Clojure][ClojureHome] projects I've been working on uses
multi-level (hierarchical) [maps][HashWikipedia] i.e. the values of the keys of a map at one level are often maps
themselves. 
</p>

<p>
A common enough use case and as [Fogus][FogusHome] and
[Chris Houser][ChouserHome] observe in their book [The Joy of Clojure][BookJoC2ed] (section 5.6):
</p>

<blockquote>
<p>
It’s difficult to write a program of any significant size without the
need for a map of some sort.
</p>

<p>
The use of maps is ubiquitous in writing software because frankly it’s
difficult to imagine a more robust data structure.
</p>
</blockquote>

<p>
Maps  have been around quite a while.  In their book [Introduction To
Algorithms][CormenBookIntroductionToAlgorithms] <span class="underline">Cormen et al</span> say Donald Knuth
[attributed][CormenBookIntroductionToAlgorithmLuhn] the invention of
maps to [Hans Peter Luhn][LuhnWikipedia] in early 1953.
</p>

<p>
Using [maps][HashWikipedia] is very natural and easy in
[Clojure][ClojureHome] and indeed many other languages that support
them. Clojure takes [Alan Perlis's][PerlisTuringAward]
famous quote to heart by providing a rich set of functions to manage maps:
</p>

<blockquote>
<p>
It’s better to have 100 functions operate on one data structure than 10 functions on 10 data structures.
</p>
</blockquote>

<p>
But using deep (multi-level) maps with many levels and many keys with long-ish
descriptive names can make the code look very cluttered and prone to
typos, misremembered key names, juxtaposition of levels, and similar,
often <span class="underline">silent</span>, errors as e.g. <span class="underline">get</span> and <span class="underline">get-in</span> will return a
value (nil) rather than raising an error, and <span class="underline">assoc</span> and <span class="underline">assoc-in</span>
wont care at all.
</p>

<p>
Its very easy in [Clojure][ClojureHome] to write function(s) to encapsulate
the accesses to a key's value, especially for multi-level keys, creating
"helper" <span class="underline">putter</span> and <span class="underline">getter</span> accessors. 
</p>

<p>
Arguably, maybe  a stretch, you could think of these accessors as
[_higher order_][HigherOrderFunctionWikipedia] functions where the (implicit) input functions are e.g.
<span class="underline">get</span> or <span class="underline">assoc</span>.
</p>

<p>
For example, and as usual a contrived example, where a deep multi-level map
holds all the details of a house:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">change-kitchen-temperature</span>
  [house-state new-temperature]
  <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">assoc-in</span> house-state [<span style="color: #008b8b;">:rooms</span> <span style="color: #008b8b;">:kitchen</span> <span style="color: #008b8b;">:properties</span> <span style="color: #008b8b;">:temperature</span>] new-temperature<span style="color: #8c8c8c;">))</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">install-kitchen-oven</span>
  [house-state new-oven]
  <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">assoc-in</span> house-state [<span style="color: #008b8b;">:rooms</span> <span style="color: #008b8b;">:kitchen</span> <span style="color: #008b8b;">:appliances</span> <span style="color: #008b8b;">:cooking</span> <span style="color: #008b8b;">:oven</span>] new-oven<span style="color: #8c8c8c;">))</span>
</pre>
</div>

<p>
Which is nice (at least to me): semantically named accessors hiding
the details of the key hierarchy.  If the hierarchy needs to change for
any reason, only the accessor functions have to be changed.  A familiar enough
paradigm from many languages.
</p>

<p>
The other thing I've wanted to do  has been
to apply  [contracts][Eiffel Design by Contract] to the <span class="underline">leaf</span> values in the map. You could
of course just use an [_assert_][ClojureDocsAssert] to apply a contract to a value in "open code".
But that means the contract definition (i.e. assertion clause)
is scattered over the code base, hard to change, inconsistency may
creep in, etc.
</p>

<p>
[Fogus's][FogusHome]
[clojure.core.contracts][ClojureCoreContractsGithub] library uses
[Clojure's][ClojureHome] [:pre and post
assertions][FogusBlogClojurePreandPost] to apply contracts to a
function's arguments and/or its result (return value). 
</p>

<p>
In my recent [sugar post][RumfordBlogClojureContractsSugar] on contracts, I demonstrated a
new library I've written
[clojure-contracts-sugar][ClojureContractsSugarGithub] to add some
productivity macros ("sugar") atop [Fogus's][FogusTwitter] [library][ClojureCoreContractsGithub].
</p>

<p>
In a nice bit of synergy, if you use <span class="underline">putter</span> and <span class="underline">getter</span> accessors
for a map's <span class="underline">leaf</span> values, you can apply also contracts to them.
</p>

<p>
Enter my new library: [clojure-contracts-maps][ClojureMapAccessorsGithub] 
</p>

<pre class="example">
&lt;!-- more --&gt;
</pre>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> A quick summary of clojure-contracts-maps</h2>
<div class="outline-text-2" id="text-2">
<p>
Apart from the ability to apply rich contracts to the <span class="underline">leaf</span> values,
the new library support some other features.
</p>

<p>
One feature useful to have is the opportunity to transform <span class="underline">map</span> a
key's value.
In the case of a getter, the <span class="underline">mapper</span> is applied <b>before</b> the value is
returned effectively returning a <span class="underline">view</span> of the value.  In the case of a <span class="underline">putter</span>,
the <span class="underline">mapper</span> can e.g. normalise the value in some way <b>before</b> the map
is "updated".
</p>

<p>
Its also useful, in a <span class="underline">getter</span>,  to support static and (per call) dynamic defaults for the key's
value.
</p>

<p>
You may also want to <span class="underline">monitor</span> a key's access, especially when it
changes, and have a unique error message - a <span class="underline">telltale</span> - when a value
fails a contract.
</p>
</div>
</div>
