doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.org
* A few notes on contracts and constraints

A _contract_ is made up of one or more _constraints_.

Each contract can have constraints of two types: _suck_ constraints
applied to a function's arguments and _spit_ constraints applied to
the function's result

*Putters* have a _suck_ contract for the key's new value  i.e the new value 
is an _argument_ to the putter.

*Getters* have _spit_ contracts as the value of the key (or its default)
is the _result_ of the getter.

If you want to use a mnemonic (see later) for a contract to apply to
both the *getter* and *putter*, the mnemonic *must* have identical
constraints for both _suck_ and _spit_.

The macro _define-mnemonics_ will define a symmetric contract. For
example, to define a symmetric mnemonic _:key-value-is-a-map-with-numeric-values_

#+BEGIN_SRC clojure :tangle no
(define-mnemonics
  key-mnemonics {:key-value-is-a-map-with-numeric-values [map? (every? number? (vals arg0))]}) 
#+END_SRC

This is the same as the explicit call below to _configure-contracts-store_
in _clojure-contracts-sugar_

#+BEGIN_SRC clojure :tangle no
(configure-contracts-store
 aspect-mnemonic-definitions
 {:key-value-is-a-map-with-numeric-values
  {:suck [map? (every? number? (vals arg0))]
   :spit [map? (every? number? (vals arg0))]}}) 
#+END_SRC

Note you can define multiple mnemonics is the call to
_define-mnemonics_, just add more key-value pairs in the
_key-mnemonics_ map.


* The Code

** Jar is on Clojars

The jar is on [Clojars][ClojarsClojureContractsMaps]:

[Leiningen][LeiningenHome] dependency information:

#+BEGIN_SRC clojure :tangle no
[name.rumford/clojure-contracts-maps "0.1.0"]
#+END_SRC

[Maven][MavenHome] dependency information:

#+BEGIN_SRC xml :tangle no
<dependency>
  <groupId>name.rumford</groupId>
  <artifactId>clojure-contracts-maps</artifactId>
  <version>0.1.0</version>
</dependency>
#+END_SRC

** Code is on Github

The code can be found on [github][ClojureMapAccessorsGithub]
as a [Leiningen][LeiningenHome]
project so you'll want Leiningen [installed][LeiningenGithub].

The project structure is Maven style but there is only Clojure today
i.e. _./src/main/clojure_ and _./src/test/clojure_.

** Tests

There are a number of tests that can be run offering reasonable coverage:

#+BEGIN_SRC bash
lein test
#+END_SRC

** Examples

The examples below can be found in the repo's examples folder
(specifically _./examples/map-examples_) and they can be run using
_lein_:

#+BEGIN_SRC bash :tangle no
cd ./examples/map-examples
lein run -m map-examples1
#+END_SRC

#+BEGIN_SRC clojure :mkdirp yes :exports none :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
(ns map-examples1
  (:require [clojure-contracts-maps :as cma
             :refer (define-map-get-accessor
                      define-map-put-accessor
                      compose-map-get-accessor
                      define-map-accessors
                      define-mnemonics)]))

#+END_SRC

The examples use a couple of harness functions - _will-work_ and
_will-fail_ - to run tests.

_will-work_ takes as arguments the expected result, the accessor
function and a list of the accessor's arguments. 

_will-fail_ takes just the accessor function and its arguments and
catches the *AssertionError* expected to be thrown.

#+BEGIN_SRC clojure :mkdirp yes :exports both :tangle :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Helper for accessor examples expected to work.  Returns the expected result, else fails

(defn will-work
  [expected-result fn-accessor & fn-args]
  (assert (= expected-result (apply fn-accessor fn-args)))
  (println "will-work" "worked as expected" "expected-result" expected-result "fn-accessor" fn-accessor "fn-args" fn-args)
  expected-result)

;; Helper for accessor examples expected to fail.  Catches the expected AssertionError, else fails.

(defn will-fail
  [fn-accessor & fn-args]
  (try
    (do
      (apply fn-accessor fn-args)
      (assert (println "will-fail" "DID NOT FAIL" "did not cause AssertionError" "fn-accessor" fn-accessor "fn-args" fn-args)))
    (catch AssertionError e
      (println "will-fail" "failed as expected" "fn-accessor" fn-accessor "fn-args" fn-args))))

#+end_src

#+BEGIN_QUOTE
The _./doc_ folder contains the source of this post: it is an [emacs][emacshome] [org][orgmodehome] file [tangled][orgmodemanualextractsourcecode] to generate the examples project.
#+END_QUOTE

#+BEGIN_SRC clojure  :exports none :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Wrapper to run all tests
(defn run-all-tests
 [& args]
#+end_src


* Getters with Simple Contracts

To define a getter call the _define-map-get-accessor_ macro with its
(minimum) arguments: 

1. the key's name; and 

2. the contract (constraints) to enforce on the key's value

#+BEGIN_QUOTE
Remember: *getter* contracts have _spit_ constraints - the contract is
applied to the result of the getter.
#+END_QUOTE


