doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> A few notes</h2>
<div class="outline-text-2" id="text-3">
<p>
A <span class="underline">contract</span> is made up of one or more <span class="underline">constraints</span>.
</p>

<p>
Each contract can have constraints of two types: <span class="underline">suck</span> constraints
applied to a function's arguments and <span class="underline">spit</span> constraints applied to
the function's result
</p>

<p>
<b>Putters</b> have a <span class="underline">suck</span> contract for the key's new value  i.e the new value 
is an <span class="underline">argument</span> to the getter accessor.
</p>

<p>
<b>Getters</b> have <span class="underline">spit</span> contracts as the value of the key (or its default)
is the <span class="underline">result</span> of the function.
</p>

<p>
If you want to use a mnemonic (see later) for a contract to apply to
both the <b>getter</b> and <b>putter</b>, the mnemonic <b>must</b> have identical
constraints for both <span class="underline">suck_and _spit</span>.
</p>

<p>
The macro <span class="underline">define-mnemonics</span> will define a symmetric contract. For
example, to define a symmetric mnemonic <span class="underline">:key-value-is-a-map-with-numeric-values</span>
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-mnemonics</span>
  <span style="color: #0000ff;">key-mnemonics</span> {<span style="color: #008b8b;">:key-value-is-a-map-with-numeric-values</span> [map? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> number? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">vals</span> arg0<span style="color: #8c8c8c;">))</span>]}<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
This is the same as the explicit call below to <span class="underline">configure-contracts-store</span>
in <span class="underline">clojure-contracts-sugar</span>
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>configure-contracts-store
 aspect-mnemonic-definitions
 {<span style="color: #008b8b;">:key-value-is-a-map-with-numeric-values</span>
  {<span style="color: #008b8b;">:suck</span> [map? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> number? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">vals</span> arg0<span style="color: #8c8c8c;">))</span>]
   <span style="color: #008b8b;">:spit</span> [map? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> number? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">vals</span> arg0<span style="color: #8c8c8c;">))</span>]}}<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Note you can define multiple mnemonics is the call to
<span class="underline">define-mnemonics</span>, just add more key-value pairs in the
<span class="underline">key-mnemonics</span> map.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> The Code</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Jar is on Clojars</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The jar is on [Clojars][ClojarsClojureContractsMaps]:
</p>

<p>
[Leiningen][LeiningenHome] dependency information:
</p>

<div class="org-src-container">

<pre class="src src-clojure">[name.rumford/clojure-contracts-maps <span style="color: #8b2252;">"0.1.0"</span>]
</pre>
</div>

<p>
[Maven][MavenHome] dependency information:
</p>

<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #0000ff;">dependency</span>&gt;
  &lt;<span style="color: #0000ff;">groupId</span>&gt;name.rumford&lt;/<span style="color: #0000ff;">groupId</span>&gt;
  &lt;<span style="color: #0000ff;">artifactId</span>&gt;clojure-contracts-maps&lt;/<span style="color: #0000ff;">artifactId</span>&gt;
  &lt;<span style="color: #0000ff;">version</span>&gt;0.1.0&lt;/<span style="color: #0000ff;">version</span>&gt;
&lt;/<span style="color: #0000ff;">dependency</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Code is on Github</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The code can be found on [github][ClojureMapAccessorsGithub]
as a [Leiningen][LeiningenHome]
project so you'll want Leiningen [installed][LeiningenGithub].
</p>

<p>
The project structure is Maven style but there is only Clojure today
i.e. <span class="underline">./src/main/clojure</span> and <span class="underline">./src/test/clojure</span>.
</p>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Tests</h3>
<div class="outline-text-3" id="text-4-3">
<p>
There are a number of tests that can be run offering reasonable coverage:
</p>

<div class="org-src-container">

<pre class="src src-bash">lein test
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> Examples</h3>
<div class="outline-text-3" id="text-4-4">
<p>
The examples below can be found in the repo's examples folder
(specifically <span class="underline">./examples/map-examples</span>) and they can be run using
<span class="underline">lein</span>:
</p>

<div class="org-src-container">

<pre class="src src-bash">cd ./examples/map-examples
lein run -m map-examples1
</pre>
</div>

<p>
The examples use a couple of harness functions - <span class="underline">will-work</span> and
<span class="underline">will-fail</span> - to run tests.
</p>

<p>
<span class="underline">will-work</span> takes as arguments the expected result, the accessor
function and a list of the accessor's arguments. 
</p>

<p>
<span class="underline">will-fail</span> takes just the accessor function and its arguments and
catches the <b>AssertionError</b> expected to be thrown.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Helper for accessor examples expected to work.  Returns the expected result, else fails</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">will-work</span>
  [expected-result fn-accessor &amp; fn-args]
  <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">assert</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">=</span> expected-result <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">apply</span> fn-accessor fn-args<span style="color: #8c8c8c;">)))</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">println</span> <span style="color: #8b2252;">"will-work"</span> <span style="color: #8b2252;">"worked as expected"</span> <span style="color: #8b2252;">"expected-result"</span> expected-result <span style="color: #8b2252;">"fn-accessor"</span> fn-accessor <span style="color: #8b2252;">"fn-args"</span> fn-args<span style="color: #8c8c8c;">)</span>
  expected-result<span style="color: #8c8c8c;">)</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Helper for accessor examples expected to fail.  Catches the expected AssertionError, else fails.</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">will-fail</span>
  [fn-accessor &amp; fn-args]
  <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">try</span>
    <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">do</span>
      <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">apply</span> fn-accessor fn-args<span style="color: #8c8c8c;">)</span>
      <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">assert</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">println</span> <span style="color: #8b2252;">"will-fail"</span> <span style="color: #8b2252;">"DID NOT FAIL"</span> <span style="color: #8b2252;">"did not cause AssertionError"</span> <span style="color: #8b2252;">"fn-accessor"</span> fn-accessor <span style="color: #8b2252;">"fn-args"</span> fn-args<span style="color: #8c8c8c;">)))</span>
    <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">catch</span> <span style="color: #483d8b;">AssertionError</span> e
      <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">println</span> <span style="color: #8b2252;">"will-fail"</span> <span style="color: #8b2252;">"failed as expected"</span> <span style="color: #8b2252;">"fn-accessor"</span> fn-accessor <span style="color: #8b2252;">"fn-args"</span> fn-args<span style="color: #8c8c8c;">))))</span>
</pre>
</div>

<blockquote>
<p>
The <span class="underline">./doc</span> folder contains the source of this post: it is an [emacs][emacshome] [org][orgmodehome] file [tangled][orgmodemanualextractsourcecode] to generate the examples project.
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Getters with Simple Contracts</h2>
<div class="outline-text-2" id="text-5">
<p>
To define a getter call the <span class="underline">define-map-get-accessor</span> macro with its
(minimum) arguments: 
</p>

<ol class="org-ol">
<li>the key's name; and 
</li>

<li>the contract (constraints) to enforce on the key's value
</li>
</ol>

<blockquote>
<p>
Remember: <b>getter</b> contracts have <span class="underline">spit</span> constraints - the contract is
applied to the result of the getter.
</p>
</blockquote>
</div>
