doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.org
** Example - a getter for a key with a numeric value

For example to ensure the value of key _:a_ is a number:

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - a getter for a key with a numeric value

;; This example shows how to define a getter function that ensures the
;; returned value of key :a is a number:
 
(def get-key-a (define-map-get-accessor :a :number))

;; Explcitly call the function

(get-key-a {:a 1})
;; =>
1

;; But lets use the will-work helper to ensure the result is as expected

(will-work 1 get-key-a {:a 1}) 
;; =>
1
#+end_src

#+BEGIN_QUOTE
Its worth noting that _:number_ here implies {:spit number?}
#+END_QUOTE

** Example - a getter using static and/or dynamic defaults

You can define the _getter_ accessor  with a static default
value to be returned if the key is not present in the map (exact
the same semantics as _get_ with a default value).

#+BEGIN_QUOTE
Note the contract is applied to the *result* of the accessor so
defaults must comply with the contract.

This is lazy though -  if a  default is never needed,
the contract will never be applied to it.
#+END_QUOTE

To provide a _static_ default use the optional parameter _default_ on
the call to _define-map-get-accessor_.

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - a getter with a static default for key :d
 
(def get-key-d (define-map-get-accessor :d :number default 42))

;; This will work

(will-work 42 get-key-d {})
;; =>
42

;; Note the key is present but its value of nil will fail the :number contract

(will-fail get-key-d {:d nil}) 
#+end_src

Alternatively a dynamic default can be provided as the second argument
in a call to the getter. 

The dynamic default takes precedence over the static one (if supplied).

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - a getter called with a dynamic, per call, default for key :d

;; The key's value, if present, alway takes precedence over any default

(will-work 55 get-key-d {:d 55} 99)
;; =>
55

;; The static default (if supplied) is used if the key is not present

(will-work 42 get-key-d {}) 
;; =>
42

;; But a per-call dynamic default take precedence over the static one

(will-work 99 get-key-d {} 99)
;; =>
99

(will-work 567 get-key-d {} 567)
;; =>
567
#+end_src


* Putters with Simple Contracts

A simple putter uses Clojure's _assoc_ function and returns the updated
map; the original map is, of course, unchanged.

You can define equivalent _putter_ accessors, constrained in the
same way as  _getters_, by calling the _define-map-put-accessor_ macro  with its
(minimum) parameters (same as for a getter): 

1. the key's name; and

2. the contract (constraints) to enforce on the key's value

#+BEGIN_QUOTE
Remember: *putter* contracts have _suck_ constraints - the contract is
applied to the argument with (new) value of the key.
#+END_QUOTE

** Example - a putter for a key with a numeric value

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - define a putter for the value of key :d which must be a number

(def put-key-d (define-map-put-accessor :d :number))

;; Create a new map with the new value for key :d

(def map-with-old-value-of-d {:d 99})

(def map-with-new-value-of-d (put-key-d map-with-old-value-of-d 123))

;; Using the getter on the updated map will return the new value of :d

(will-work 123 get-key-d map-with-new-value-of-d)
;; =>
123

;; The old map is of course unchanged

(will-work 99 get-key-d map-with-old-value-of-d)
;; =>
99
#+end_src


* Using a telltale to aid diagnosis of assertion errors

Errors generated by Clojure's [pre and post assertions][[[FogusBlogClojurePreAndPost]]] 
are of type *AssertionError*.

Although they produce a (Java) stack track and precisely specify the
assertion causing the error, they do not provide any information to
identify the context  of the error i.e. which key suffered the error?

As an aid to providing some context and help identify the
cause of the error, you can provide an optional _telltale_ parameter to the
accessor function definition.  The _telltale_ is a description (string) to be printed
if/when an *AssertionError* occurs.

