doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.html


<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Example - a getter for a key with a numeric value</h3>
<div class="outline-text-3" id="text-5-1">
<p>
For example to ensure the value of key <span class="underline">:a</span> is a number:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - a getter for a key with a numeric value</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This example shows how to define a getter function that ensures the</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">returned value of key :a is a number:</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-a</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-get-accessor</span> <span style="color: #0000ff;">:a</span> <span style="color: #008b8b;">:number</span><span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Explcitly call the function</span>

<span style="color: #8c8c8c;">(</span>get-key-a {<span style="color: #008b8b;">:a</span> 1}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
1

<span style="color: #006400;">;; </span><span style="color: #006400;">But lets use the will-work helper to ensure the result is as expected</span>

<span style="color: #8c8c8c;">(</span>will-work 1 get-key-a {<span style="color: #008b8b;">:a</span> 1}<span style="color: #8c8c8c;">)</span> 
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
1
</pre>
</div>

<blockquote>
<p>
Its worth noting that <span class="underline">:number</span> here implies {:spit number?}
</p>
</blockquote>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Example - a getter using static and/or dynamic defaults</h3>
<div class="outline-text-3" id="text-5-2">
<p>
You can define the <span class="underline">getter</span> accessor  with a static default
value to be returned if the key is not present in the map (exact
the same semantics as <span class="underline">get</span> with a default value).
</p>

<blockquote>
<p>
Note the contract is applied to the <b>result</b> of the accessor so
defaults must comply with the contract.
</p>

<p>
This is lazy though -  if a  default is never needed,
the contract will never be applied to it.
</p>
</blockquote>

<p>
To provide a <span class="underline">static</span> default use the optional parameter <span class="underline">default</span> on
the call to <span class="underline">define-map-get-accessor</span>.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - a getter with a static default for key :d</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-d</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-get-accessor</span> <span style="color: #0000ff;">:d</span> <span style="color: #008b8b;">:number</span> default 42<span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This will work</span>

<span style="color: #8c8c8c;">(</span>will-work 42 get-key-d {}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
42

<span style="color: #006400;">;; </span><span style="color: #006400;">Note the key is present but its value of nil will fail the :number contract</span>

<span style="color: #8c8c8c;">(</span>will-fail get-key-d {<span style="color: #008b8b;">:d</span> nil}<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
Alternatively a dynamic default can be provided as the second argument
in a call to the getter. 
</p>

<p>
The dynamic default takes precedence over the static one (if supplied).
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - a getter called with a dynamic, per call, default for key :d</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">The key's value, if present, alway takes precedence over any default</span>

<span style="color: #8c8c8c;">(</span>will-work 55 get-key-d {<span style="color: #008b8b;">:d</span> 55} 99<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
55

<span style="color: #006400;">;; </span><span style="color: #006400;">The static default (if supplied) is used if the key is not present</span>

<span style="color: #8c8c8c;">(</span>will-work 42 get-key-d {}<span style="color: #8c8c8c;">)</span> 
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
42

<span style="color: #006400;">;; </span><span style="color: #006400;">But a per-call dynamic default take precedence over the static one</span>

<span style="color: #8c8c8c;">(</span>will-work 99 get-key-d {} 99<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
99

<span style="color: #8c8c8c;">(</span>will-work 567 get-key-d {} 567<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
567
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Putters with Simple Contracts</h2>
<div class="outline-text-2" id="text-6">
<p>
A simple putter uses Clojure's <span class="underline">assoc</span> function and returns the updated
map; the original map is, of course, unchanged.
</p>

<p>
You can define equivalent <span class="underline">putter</span> accessors, constrained in the
same way as  <span class="underline">getters</span>, by calling the <span class="underline">define-map-put-accessor</span> macro  with its
(minimum) parameters (same as for a getter): 
</p>

<ol class="org-ol">
<li>the key's name; and
</li>

<li>the contract (constraints) to enforce on the key's value
</li>
</ol>

<blockquote>
<p>
Remember: <b>putter</b> contracts have <span class="underline">suck</span> constraints - the contract is
applied to the argument with (new) value of the key.
</p>
</blockquote>
</div>

<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Example - a putter for a key with a numeric value</h3>
<div class="outline-text-3" id="text-6-1">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - define a putter for the value of key :d which must be a number</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">put-key-d</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-put-accessor</span> <span style="color: #0000ff;">:d</span> <span style="color: #008b8b;">:number</span><span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Create a new map with the new value for key :d</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">map-with-old-value-of-d</span> {<span style="color: #008b8b;">:d</span> 99}<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">map-with-new-value-of-d</span> <span style="color: #8c8c8c;">(</span>put-key-d map-with-old-value-of-d 123<span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Using the getter on the updated map will return the new value of :d</span>

<span style="color: #8c8c8c;">(</span>will-work 123 get-key-d map-with-new-value-of-d<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
123

<span style="color: #006400;">;; </span><span style="color: #006400;">The old map is of course unchanged</span>

<span style="color: #8c8c8c;">(</span>will-work 99 get-key-d map-with-old-value-of-d<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
99
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Using a telltale to aid diagnosis of assertion errors</h2>
<div class="outline-text-2" id="text-7">
<p>
Errors generated by Clojure's [:pre and :post assertions][<i>FogusBlogClojurePreAndPost</i>] 
are of type <b>AssertionError</b>.
</p>

<p>
Although they produce a (Java) stack track and precisely specify the
assertion causing the error, they do not provide any information to
identify the context  of the error i.e. which key suffered the error?
</p>

<p>
As an aid to providing some context and help identify the
cause of the error, you can provide an optional <span class="underline">telltale</span> parameter to the
accessor function definition.  The <span class="underline">telltale</span> is a description (string) to be printed
if/when an <b>AssertionError</b> occurs.
</p>
</div>
