doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.org
** Example - a getter with a telltale

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - a getter with a telltale
 
(def get-key-d (define-map-get-accessor :d :number default 42 telltale "The value of key :d was not a number"))

;; The call to get-key-d below will fail with an asertion error

(will-fail get-key-d {:d "value of d must be a string else will fail"}) 
;; =>  will fail with message something like:
;; Contract Failure Value >class clojure.lang.PersistentArrayMap< >{:d "value of d must be a string else will fail"}< REASON The value of key :d was not a number
#+end_src

** Example - a putter with a telltale

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - a putter with a telltale
 
(def put-key-e (define-map-put-accessor :e :string telltale "The new value of key :e was not a string"))

;; The call to put-key-e below will fail with an asertion error

(will-fail put-key-e {:e ":e is always a string"} 123) 
;; =>  will fail with message something like:
;; Contract Failure Value >class clojure.lang.PersistentArrayMap< >{:d ":e is always a string"}< REASON The new value of key :e was not a string
#+end_src


* Contracts for Keys with multiple constraints

In  the examples so far the contract (constraints)  applied to the value of a
key has been simple - e.g. just a number or string.

In fact, contracts  can be far "richer": You can use anything supported by
[clojure-contracts-sugar][ClojureContractsSugarGithub].  

Rich contracts were illustrated in my 
[contracts sugar post][RumfordBlogClojureContractsSugar] and allow one or more 
constraints to be applied to the key's value.  

Multiple constraints can be specified in the definition of the accessor simply as a vector of the individual constraints.

Or you can use _mnemonics_ to "package" rich, complex contracts with multiple constraints,
again as described in the [sugar post][RumfordBlogClojureContractsSugar].

Some examples should help flesh this out.

** Example - a getter for a positive numeric key value

To ensure a key's value is a positive number, the contract's vector of
constraints would be:

#+BEGIN_SRC clojure :tangle no
[:number :pos]
#+END_SRC

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - a getter for a positive numeric key value

(def get-key-m (define-map-get-accessor :m [:number :pos] telltale ":m must be a positive number"))

;; This works

(will-work 3 get-key-m {:m 3})
;; =>
3

;; But this will fail

(will-fail get-key-m {:m -3})
;; => And should produce a message like:
;; Contract Failure Value >class clojure.lang.PersistentArrayMap< >{:m -3}< KEY :m REASON :m must be a positive number
#+end_src

** Example - a getter to ensure a key's value is a map with keyword keys and numeric values

Using an example based on one in the [sugar
post][RumfordBlogClojureContractsSugar], this one needs to ensure a key's new value is a map, and its keys are keywords and
the values are numbers. The contract is:

#+BEGIN_SRC  clojure :tangle no
[:map (every? keyword? (keys arg0)) (every? number? (vals arg0))]
#+END_SRC

Note the key's value is available for use explicitly in the contract
as _arg0_ - see the [sugar post][RumfordBlogClojureContractsSugar] for
an explanation of the use of _relative_ argument names such as _arg0_.

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - a getter to ensure a key's value is a map with keyword keys and numeric values

;; Note the constraint form uses arg0 to refer to the passed map

(def get-key-n (define-map-get-accessor :n [:map (every? keyword? (keys arg0)) (every? number? (vals arg0))] telltale ":n must be a map with keywords keys and numeric values"))

;; This works

(will-work {:a 1 :b 2 :c 3} get-key-n {:n {:a 1 :b 2 :c 3}})
;; =>
{:a 1 :b 2 :c 3}

;; But this will fail

(will-fail get-key-n {:n {"x" 1 "y" 2 "z" 3}})
;; => And should produce a message like:
;; Contract Failure Value >class clojure.lang.PersistentArrayMap< >{:n {"x" 1, "y" 2, "z" 3}}< KEY :n REASON :n must be a map with keywords keys and numeric values
#+end_src

