doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.html

<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Example - a getter with a telltale</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - a getter with a telltale</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-d</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-get-accessor</span> <span style="color: #0000ff;">:d</span> <span style="color: #008b8b;">:number</span> default 42 telltale <span style="color: #8b2252;">"The value of key :d was not a number"</span><span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">The call to get-key-d below will fail with an asertion error</span>

<span style="color: #8c8c8c;">(</span>will-fail get-key-d {<span style="color: #008b8b;">:d</span> <span style="color: #8b2252;">"value of d must be a string else will fail"</span>}<span style="color: #8c8c8c;">)</span> 
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;  will fail with message something like:</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">Contract Failure Value &gt;class clojure.lang.PersistentArrayMap&lt; &gt;{:d "value of d must be a string else will fail"}&lt; REASON The value of key :d was not a number</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2"><span class="section-number-3">7.2</span> Example - a putter with a telltale</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - a putter with a telltale</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">put-key-e</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-put-accessor</span> <span style="color: #0000ff;">:e</span> <span style="color: #008b8b;">:string</span> telltale <span style="color: #8b2252;">"The new value of key :e was not a string"</span><span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">The call to put-key-e below will fail with an asertion error</span>

<span style="color: #8c8c8c;">(</span>will-fail put-key-e {<span style="color: #008b8b;">:e</span> <span style="color: #8b2252;">":e is always a string"</span>} 123<span style="color: #8c8c8c;">)</span> 
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;  will fail with message something like:</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">Contract Failure Value &gt;class clojure.lang.PersistentArrayMap&lt; &gt;{:d ":e is always a string"}&lt; REASON The new value of key :e was not a string</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Contracts for Keys with multiple constraints</h2>
<div class="outline-text-2" id="text-8">
<p>
In  the examples so far the contract (constraints)  applied to the value of a
key has been simple - e.g. just a number or string.
</p>

<p>
In fact, contracts  can be far "richer": You can use anything supported by
[clojure-contracts-sugar][ClojureContractsSugarGithub].  
</p>

<p>
Rich contracts were illustrated in my 
[contracts sugar post][RumfordBlogClojureContractsSugar] and allow one or more 
constraints to be applied to the key's value.  
</p>

<p>
Multiple constraints can be specified in the definition of the accessor simply as a vector of the individual constraints.
</p>

<p>
Or you can use <span class="underline">mnemonics</span> to "package" rich, complex contracts with multiple constraints,
again as described in the [sugar post][RumfordBlogClojureContractsSugar].
</p>

<p>
Some examples should help flesh this out.
</p>
</div>

<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Example - a getter for a positive numeric key value</h3>
<div class="outline-text-3" id="text-8-1">
<p>
To ensure a key's value is a positive number, the contract's vector of
constraints would be:
</p>

<div class="org-src-container">

<pre class="src src-clojure">[<span style="color: #008b8b;">:number</span> <span style="color: #008b8b;">:pos</span>]
</pre>
</div>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - a getter for a positive numeric key value</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-m</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-get-accessor</span> <span style="color: #0000ff;">:m</span> [<span style="color: #008b8b;">:number</span> <span style="color: #008b8b;">:pos</span>] telltale <span style="color: #8b2252;">":m must be a positive number"</span><span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This works</span>

<span style="color: #8c8c8c;">(</span>will-work 3 get-key-m {<span style="color: #008b8b;">:m</span> 3}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
3

<span style="color: #006400;">;; </span><span style="color: #006400;">But this will fail</span>

<span style="color: #8c8c8c;">(</span>will-fail get-key-m {<span style="color: #008b8b;">:m</span> -3}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt; And should produce a message like:</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">Contract Failure Value &gt;class clojure.lang.PersistentArrayMap&lt; &gt;{:m -3}&lt; KEY :m REASON :m must be a positive number</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Example - a getter to ensure a key's value is a map with keyword keys and numeric values</h3>
<div class="outline-text-3" id="text-8-2">
<p>
Using an example based on one in the [sugar
post][RumfordBlogClojureContractsSugar], this one needs to ensure a key's new value is a map, and its keys are be keywords and
the values numbers. The contract would be:
</p>

<div class="org-src-container">

<pre class="src src-clojure">[<span style="color: #008b8b;">:map</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> keyword? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">keys</span> arg0<span style="color: #8c8c8c;">))</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> number? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">vals</span> arg0<span style="color: #8c8c8c;">))</span>]
</pre>
</div>

<p>
Note the key's value is available for use explicitly in the contract
as <span class="underline">arg0</span> - see the [sugar post][RumfordBlogClojureContractsSugar] for
an explanation of the use of <span class="underline">relative</span> argument names such as <span class="underline">arg0</span>.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - a getter to ensure a key's value is a map with keyword keys and numeric values</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Note the constraint form uses arg0 to refer to the passed map</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-n</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-get-accessor</span> <span style="color: #0000ff;">:n</span> [<span style="color: #008b8b;">:map</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> keyword? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">keys</span> arg0<span style="color: #8c8c8c;">))</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> number? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">vals</span> arg0<span style="color: #8c8c8c;">))</span>] telltale <span style="color: #8b2252;">":n must be a map with keywords keys and numeric values"</span><span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This works</span>

<span style="color: #8c8c8c;">(</span>will-work {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3} get-key-n {<span style="color: #008b8b;">:n</span> {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
{<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}

<span style="color: #006400;">;; </span><span style="color: #006400;">But this will fail</span>

<span style="color: #8c8c8c;">(</span>will-fail get-key-n {<span style="color: #008b8b;">:n</span> {<span style="color: #8b2252;">"x"</span> 1 <span style="color: #8b2252;">"y"</span> 2 <span style="color: #8b2252;">"z"</span> 3}}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt; And should produce a message like:</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">Contract Failure Value &gt;class clojure.lang.PersistentArrayMap&lt; &gt;{:n {"x" 1, "y" 2, "z" 3}}&lt; KEY :n REASON :n must be a map with keywords keys and numeric values</span>
</pre>
</div>
</div>
</div>
