doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.org
** Example - a getter with a custom predicate

You can define your own predicate functions, not just use
[Clojure's][ClojureHome] "built-ins" (e.g. _map?_, _number?_,
_string?_, etc). For example, a predicate function to ensure the value is a map with
keywords keys and numeric values would be
something like this:

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - a custom predicate to ensure a map's keys are keywords and values are numeric

(defn is-map-with-keyword-keys-and-numeric-values?
  [source-map]
  {:pre [(map? source-map) (every? keyword? (keys source-map)) (every? number? (vals source-map))]}
  source-map)
#+end_src

# #+BEGIN_QUOTE
# Note the predicate function must be fully resolved in the call to the accessor definition by adding a [syntax-quote][8thLightBlokQuotingWithoutConfusion] (single back quote).
# #+END_QUOTE

The custom predicate can be used in the accessor definition just like
a "built-in":

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - a rich getter using a custom predicate

(def get-key-p (define-map-get-accessor :p is-map-with-keyword-keys-and-numeric-values?  telltale ":p failed predicate is-map-with-keyword-keys-and-numeric-values?"))

;; This works

(will-work {:a 1 :b 2 :c 3} get-key-p {:p {:a 1 :b 2 :c 3}})
;; =>
{:a 1 :b 2 :c 3}

;; But this will fail

(will-fail get-key-p {:p {"x" 1 "y" 2 "z" 3}})
;; => And should produce a message like:
;; Contract Failure Value >class clojure.lang.PersistentArrayMap< >{:p {"x" 1, "y" 2, "z" 3}}< KEY :p REASON :p failed predicate is-map-with-keyword-keys-and-numeric-values?
#+end_src

** Example - a getter with a custom mnemonic for the key

_Mnemonics_ are a feature of
[clojure-contracts-sugar][ClojureContractsSugarGithub] for defining,
re-using and composing contracts, usually with multiple constraints.

This example again is based loosely on one in my [sugar
post][RumfordBlogClojureContractsSugar] and demonstrates how to implement the
_is-map-with-keyword-keys-and-numeric-values?_ predicate function
using a mnemonic.

#+BEGIN_QUOTE
Note the example uses the *sugar* macro _define-mnemonics_ to simplify the
definition of a symmetric (i.e. _suck_ and _spit_) contract suitable
for use in the definition of both a getter (spit) *and* putter (suck).
#+END_QUOTE

#+BEGIN_SRC clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Define a custom mnemonic map-special ensuring a map with keyword keys and numeric values.

;; Note the mnemonic is suitable for a both a getter and putter i.e it has the same *suck* and *spit* constraints

(define-mnemonics
  key-mnemonics {:key-value-is-a-map-with-numeric-values [map? (every? number? (vals arg0))]}) 
#+END_SRC

The example:

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - a getter with a custom mnemonic for the key

;; Use the :key-value-is-a-map-with-numeric-values mnemonic for the key contract 
;; to ensure the key's value is a map with numeric values.

(def get-key-q (define-map-get-accessor :q :key-value-is-a-map-with-numeric-values telltale ":q failed contract key-value-is-a-map-with-numeric-values"))

;; This works

(will-work {:a 1 :b 2 :c 3} get-key-q {:q {:a 1 :b 2 :c 3}})
;; =>
{:a 1 :b 2 :c 3}

;; But this will fail

(will-fail get-key-q {:q {:a :one :b :two :c :three}})
;; => And should produce a message like:
;; Contract Failure Value >class clojure.lang.PersistentArrayMap< >{:q {:a :one :b :two :c :three}}< KEY :q REASON :q failed contract key-value-is-a-map-with-numeric-values
#+end_src


* Contracts for the Map

So far, I've not said anything about the map argument itself, or
whether a contract (constraints) is applied to it.

In fact, behind the scenes, a contract *is*  applied automatically to
the map but its minimal: just _map?_

But the default contract for the map  can be overidden using the
_map-contract_ parameter on the call to e.g.
_define-map-get-accessor_.

Just like contracts for a key, map contracts can be anything
supported by [clojure-contracts-sugar][ClojureContractsSugarGithub],
especially mnemonics.

