doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.html
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> Example - a getter with a custom predicate</h3>
<div class="outline-text-3" id="text-8-3">
<p>
You can define your own predicate functions, not just use
[Clojure's][ClojureHome] "built-ins" (e.g. <span class="underline">map?</span>, <span class="underline">number?</span>,
<span class="underline">string?</span>, etc). For example, a predicate function to ensure the value is a map with
keywords keys and numeric values would be
something like this:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - a custom predicate to ensure a map's keys are keywords and values are numeric</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">is-map-with-keyword-keys-and-numeric-values?</span>
  [source-map]
  {<span style="color: #008b8b;">:pre</span> [<span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">map?</span> source-map<span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> keyword? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">keys</span> source-map<span style="color: #8c8c8c;">))</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> number? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">vals</span> source-map<span style="color: #8c8c8c;">))</span>]}
  source-map<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
The custom predicate can be used in the accessor definition just like
a "built-in":
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - a rich getter using a custom predicate</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-p</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-get-accessor</span> <span style="color: #0000ff;">:p</span> is-map-with-keyword-keys-and-numeric-values?  telltale <span style="color: #8b2252;">":p failed predicate is-map-with-keyword-keys-and-numeric-values?"</span><span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This works</span>

<span style="color: #8c8c8c;">(</span>will-work {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3} get-key-p {<span style="color: #008b8b;">:p</span> {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
{<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}

<span style="color: #006400;">;; </span><span style="color: #006400;">But this will fail</span>

<span style="color: #8c8c8c;">(</span>will-fail get-key-p {<span style="color: #008b8b;">:p</span> {<span style="color: #8b2252;">"x"</span> 1 <span style="color: #8b2252;">"y"</span> 2 <span style="color: #8b2252;">"z"</span> 3}}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt; And should produce a message like:</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">Contract Failure Value &gt;class clojure.lang.PersistentArrayMap&lt; &gt;{:p {"x" 1, "y" 2, "z" 3}}&lt; KEY :p REASON :p failed predicate is-map-with-keyword-keys-and-numeric-values?</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> Example - a getter with a custom mnemonic for the key</h3>
<div class="outline-text-3" id="text-8-4">
<p>
<span class="underline">Mnemonics</span> are a feature of
[clojure-contracts-sugar][GithubClojureContractsSugar] for defining,
re-using and composing contracts, usually with multiple constraints.
</p>

<p>
This example again is based loosely on one in my [sugar
post][RumfordBlogClojureContractsSugar] - where you can read all about
<span class="underline">mnemonics</span> - and demonstrates how to implement the
<span class="underline">is-map-with-keyword-keys-and-numeric-values?</span> predicate function
using a mnemonic.
</p>

<blockquote>
<p>
Note the example uses the <b>sugar</b> macro <span class="underline">define-mnemonics</span> to simplify the
definition of a symmetric (i.e. <span class="underline">suck</span> and <span class="underline">spit</span>) contract suitable
for use in the definition of both a getter (spit) <b>and</b> putter (suck).
</p>
</blockquote>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Define a custom mnemonic map-special ensuring a map with keyword keys and numeric values.</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Note the mnemonic is suitable for a both a getter and putter i.e it has the same *suck* and *spit* constraints</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-mnemonics</span>
  <span style="color: #0000ff;">key-mnemonics</span> {<span style="color: #008b8b;">:key-value-is-a-map-with-numeric-values</span> [map? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> number? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">vals</span> arg0<span style="color: #8c8c8c;">))</span>]}<span style="color: #8c8c8c;">)</span>
</pre>
</div>

<p>
The example:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - a getter with a custom mnemonic for the key</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Use the :key-value-is-a-map-with-numeric-values mnemonic for the key contract </span>
<span style="color: #006400;">;; </span><span style="color: #006400;">to ensure the key's value is a map with numeric values.</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-q</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-get-accessor</span> <span style="color: #0000ff;">:q</span> <span style="color: #008b8b;">:key-value-is-a-map-with-numeric-values</span> telltale <span style="color: #8b2252;">":q failed contract key-value-is-a-map-with-numeric-values"</span><span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This works</span>

<span style="color: #8c8c8c;">(</span>will-work {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3} get-key-q {<span style="color: #008b8b;">:q</span> {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
{<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}

<span style="color: #006400;">;; </span><span style="color: #006400;">But this will fail</span>

<span style="color: #8c8c8c;">(</span>will-fail get-key-q {<span style="color: #008b8b;">:q</span> {<span style="color: #008b8b;">:a</span> <span style="color: #008b8b;">:one</span> <span style="color: #008b8b;">:b</span> <span style="color: #008b8b;">:two</span> <span style="color: #008b8b;">:c</span> <span style="color: #008b8b;">:three</span>}}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt; And should produce a message like:</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">Contract Failure Value &gt;class clojure.lang.PersistentArrayMap&lt; &gt;{:q {:a :one :b :two :c :three}}&lt; KEY :q REASON :q failed contract key-value-is-a-map-with-numeric-values</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Contracts for the Map</h2>
<div class="outline-text-2" id="text-9">
<p>
So far, I've not said anything about the map argument itself, or
whether a contract (constraints) is applied to it.
</p>

<p>
In fact, behind the scenes, a contract <b>is</b>  applied automatically to
the map but its minimal: just <span class="underline">map?</span>
</p>

<p>
But the default contract for the map  can be overidden using the
<span class="underline">map-contract</span> parameter on the call to e.g.
<span class="underline">define-map-get-accessor</span>.
</p>

<p>
Just like contracts for a key, map contracts can be anything
supported by [clojure-contracts-sugar][GithubClojureContractsSugar],
especially mnemonics.
</p>
</div>
