doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.org
** Example - applying a contract to the map itself

In the example below the _sugar_ macro _define-mnemonics_
defines a contract suitable for the map argument (specifically a
_suck-only_ contract).

It also defines a key mnemonic to ensure the key's value is a map with
positive numeric values.

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - applying a contract to the map itself

;; Define the mnemonics

(define-mnemonics
  map-mnemonics {:map-with-keyword-keys [map? (every? keyword? (keys arg0))]}

  key-mnemonics {:key-is-a-map-with-positive-numeric-values [map? (every? number? (vals arg0)) (every? pos? (vals arg0))] }) 

;; Use both contracts

(def get-key-q (define-map-get-accessor :q :key-is-a-map-with-positive-numeric-values 
                 map-contract :map-with-keyword-keys telltale ":q failed key contract key-is-a-map-with-positive-numeric-values or map contract map-with-keyword-keys"))

;; This works

(will-work {:a 1 :b 2 :c 3} get-key-q {:q {:a 1 :b 2 :c 3}})
;; =>
{:a 1 :b 2 :c 3}

;; But this will fail as the value of :a is -1

(will-fail get-key-q {:q {:a -1 :b 2 :c 3}})
;; => And should produce a message like:
;; Contract Failure Value >class clojure.lang.PersistentArrayMap< >{:q {:a -1 :b 2 :c 3}}}< KEY :q REASON :q failed key contract :key-is-a-map-with-positive-numeric-values or map contract map-with-keyword-keys
#+end_src


* Using Transformation Functions (mappers)

** Example - putters with mappers

Sometimes its useful to be also to transform - _map_ - the (new) value of a key
before _putting_ into the map.  For example to _normalise_ the value in
some way (e.g. - trivially - string-ify and lower case).

To provide a transformation function, use the _mapper_ parameter on
the call to _define-map-putter_.  Your can specify more than one
mapper - just provide a vector of them.  Multiple mappers are
applied in the same order as [comp][ClojureDocsComp]  i.e. rightmost first.

Note the key's contract is applied to the *transformed* value.

The example has a mapper that just converts the argument into a string
and counts the number of characters.  (Note the stringified keyword
includes the leading colon.)

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - putters with mappers

(def put-key-f (define-map-put-accessor :f :number  mapper (fn [s] (count (str s))) telltale ":f must be a number"))

;; These will work

(will-work {:f 6} put-key-f {} "6chars")
(will-work {:f 7} put-key-f {} :7chars)
#+end_src

