doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.html

<div id="outline-container-sec-9-1" class="outline-3">
<h3 id="sec-9-1"><span class="section-number-3">9.1</span> Example - applying a contract to the map itself</h3>
<div class="outline-text-3" id="text-9-1">
<p>
In the example below the <span class="underline">sugar</span> macro <span class="underline">define-mnemonics</span>
defines a contract suitable for the map argument (specifically a
<span class="underline">suck-only</span> contract).
</p>

<p>
It also defines a key mnemonic to ensure the key's value is a map with
positive numeric values.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - applying a contract to the map itself</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Define the mnemonics</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-mnemonics</span>
  <span style="color: #0000ff;">map-mnemonics</span> {<span style="color: #008b8b;">:map-with-keyword-keys</span> [map? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> keyword? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">keys</span> arg0<span style="color: #8c8c8c;">))</span>]}

  key-mnemonics {<span style="color: #008b8b;">:key-is-a-map-with-positive-numeric-values</span> [map? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> number? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">vals</span> arg0<span style="color: #8c8c8c;">))</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> pos? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">vals</span> arg0<span style="color: #8c8c8c;">))</span>] }<span style="color: #8c8c8c;">)</span> 

<span style="color: #006400;">;; </span><span style="color: #006400;">Use both contracts</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-q</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-get-accessor</span> <span style="color: #0000ff;">:q</span> <span style="color: #008b8b;">:key-is-a-map-with-positive-numeric-values</span> 
                 map-contract <span style="color: #008b8b;">:map-with-keyword-keys</span> telltale <span style="color: #8b2252;">":q failed key contract key-is-a-map-with-positive-numeric-values or map contract map-with-keyword-keys"</span><span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This works</span>

<span style="color: #8c8c8c;">(</span>will-work {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3} get-key-q {<span style="color: #008b8b;">:q</span> {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
{<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}

<span style="color: #006400;">;; </span><span style="color: #006400;">But this will fail as the value of :a is -1</span>

<span style="color: #8c8c8c;">(</span>will-fail get-key-q {<span style="color: #008b8b;">:q</span> {<span style="color: #008b8b;">:a</span> -1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt; And should produce a message like:</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">Contract Failure Value &gt;class clojure.lang.PersistentArrayMap&lt; &gt;{:q {:a -1 :b 2 :c 3}}}&lt; KEY :q REASON :q failed key contract :key-is-a-map-with-positive-numeric-values or map contract map-with-keyword-keys</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Using Transformation Functions (mappers)</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Example - putters with mappers</h3>
<div class="outline-text-3" id="text-10-1">
<p>
Sometimes its useful to be also to transform - <span class="underline">map</span> - the (new) value of a key
before <span class="underline">putting</span> into the map.  For example to <span class="underline">normalise</span> the value in
some way (e.g. - trivially - string-ify and lower case).
</p>

<p>
Note the key's contract is applied to the <b>transformed</b> value.
</p>

<p>
To provide a transformation function, use the <span class="underline">mapper</span> parameter on
the call to <span class="underline">define-map-putter</span>.  Your can specify more than one
mapper - just provide a vector of functions.  Multiple mappers are
applied in the same order as <span class="underline">comp</span> i..e rightmost first.
</p>

<p>
The example has a mapper that just converts the argument into a string
and counts the number of characters.  (Note the stringified keyword
includes the leading colon.)
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - putters with mappers</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">put-key-f</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-put-accessor</span> <span style="color: #0000ff;">:f</span> <span style="color: #008b8b;">:number</span>  mapper (fn [s] <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">count</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">str</span> s<span style="color: #8c8c8c;">)))</span> telltale <span style="color: #8b2252;">":f must be a number"</span><span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">These will work</span>

<span style="color: #8c8c8c;">(</span>will-work {<span style="color: #008b8b;">:f</span> 6} put-key-f {} <span style="color: #8b2252;">"6chars"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span>will-work {<span style="color: #008b8b;">:f</span> 7} put-key-f {} <span style="color: #008b8b;">:7chars</span><span style="color: #8c8c8c;">)</span>
</pre>
</div>
</div>
</div>
