doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.html
<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> Example - getters with mappers</h3>
<div class="outline-text-3" id="text-10-2">
<p>
In a similar vein, for a <span class="underline">getter</span>, there may be times when it is
useful to transform the key's value  <b>before</b> it is returned.
</p>

<p>
For example, defining additional <span class="underline">getters</span> for the same key that holds
a map to return <span class="underline">views</span> of the value e.g. just the keys, just the
values, the sum of the values, whatever. Or, perhaps, create a
derivative value e.g. instantiate a Java class instance.
</p>

<p>
When using a <span class="underline">mapper</span> with a <span class="underline">getter</span>, the contract (e.g. :number)
is applied to the <b>transformed</b> value, not the value itself
(e.g. :map). (You could apply a contract to the
key's actual value using the map contract.)
</p>

<p>
Note in the example below a key mnemonic is applied to the map.  This
is ok; only the <span class="underline">suck</span> constraints in the key mnemonic will be
applied to the map.
</p>

<p>
The example also shows how mnemonics can be <b>composed</b> - see the
[sugar post][RumfordBlogClojureContractsSugar] for details. Composed
mnemonics in the call to <span class="underline">define-mnemonics</span> are:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #008b8b;">:key-is-a-map-with-keyword-keys-and-postive-numeric-values</span> [<span style="color: #008b8b;">:map-with-keyword-keys</span> <span style="color: #008b8b;">:map-with-positive-numeric-values</span>]
</pre>
</div>

<p>
and
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #008b8b;">:collection-of-positive-numeric-values</span> [<span style="color: #008b8b;">:collection-of-numeric-values</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> pos? arg0<span style="color: #8c8c8c;">)</span>]
</pre>
</div>

<p>
The example:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - getters with mappers</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Define some mnemonics. Note a key contract mnemonic is applied to the</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">map. Also mnemonics are composed</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-mnemonics</span>
  <span style="color: #0000ff;">key-mnemonics</span> {<span style="color: #008b8b;">:map-with-keyword-keys</span> [map? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> keyword? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">keys</span> arg0<span style="color: #8c8c8c;">))</span>]

                 <span style="color: #008b8b;">:map-with-positive-numeric-values</span> [map? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> number? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">vals</span> arg0<span style="color: #8c8c8c;">))</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> pos? <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">vals</span> arg0<span style="color: #8c8c8c;">))</span>]

                 <span style="color: #008b8b;">:key-is-a-map-with-keyword-keys-and-postive-numeric-values</span> [<span style="color: #008b8b;">:map-with-keyword-keys</span> <span style="color: #008b8b;">:map-with-positive-numeric-values</span>]

                 <span style="color: #008b8b;">:collection-of-keywords</span> [<span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">coll?</span> arg0<span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> keyword? arg0<span style="color: #8c8c8c;">)</span>]

                 <span style="color: #008b8b;">:collection-of-numeric-values</span> [<span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">coll?</span> arg0<span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> number? arg0<span style="color: #8c8c8c;">)</span>]

                 <span style="color: #008b8b;">:collection-of-positive-numeric-values</span> [<span style="color: #008b8b;">:collection-of-numeric-values</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">every?</span> pos? arg0<span style="color: #8c8c8c;">)</span>]}<span style="color: #8c8c8c;">)</span>


<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-g</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-get-accessor</span> <span style="color: #0000ff;">:g</span>
                 <span style="color: #008b8b;">:key-is-a-map-with-keyword-keys-and-postive-numeric-values</span>
                 map-contract <span style="color: #008b8b;">:map-with-keyword-keys</span> telltale <span style="color: #8b2252;">":g must be a map with keyword keys and postivie values"</span><span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Define extra getters for the keys and values of :g's map,</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">both of which must be collections (coll?) of keywords or positive</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">numeric values</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-g-keys</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-get-accessor</span> <span style="color: #0000ff;">:g</span> <span style="color: #008b8b;">:collection-of-keywords</span>
                      map-contract <span style="color: #008b8b;">:map-with-keyword-keys</span> mapper (fn [m] <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">keys</span> m<span style="color: #8c8c8c;">))</span> telltale <span style="color: #8b2252;">":g keys must be a collection"</span><span style="color: #8c8c8c;">))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-g-vals</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-get-accessor</span> <span style="color: #0000ff;">:g</span> <span style="color: #008b8b;">:collection-of-positive-numeric-values</span>
                      map-contract <span style="color: #008b8b;">:map-with-keyword-keys</span> mapper (fn [m] <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">vals</span> m<span style="color: #8c8c8c;">))</span> telltale <span style="color: #8b2252;">":g values must be a collection"</span><span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Test data</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">test-map1</span> {<span style="color: #008b8b;">:g</span> {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}}<span style="color: #8c8c8c;">)</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">test-map1-g-keys</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">keys</span> <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:g</span> test-map1<span style="color: #8c8c8c;">)))</span>
<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">test-map1-g-vals</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">vals</span> <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:g</span> test-map1<span style="color: #8c8c8c;">)))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Test the keys</span>

<span style="color: #8c8c8c;">(</span>will-work test-map1-g-keys get-key-g-keys test-map1<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
'<span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:a</span> <span style="color: #008b8b;">:c</span> <span style="color: #008b8b;">:b</span><span style="color: #8c8c8c;">)</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Test the values</span>

<span style="color: #8c8c8c;">(</span>will-work test-map1-g-vals get-key-g-vals test-map1<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
'<span style="color: #8c8c8c;">(</span>1 3 2<span style="color: #8c8c8c;">)</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Another getter to sum the values</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-g-sum-vals</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-get-accessor</span> <span style="color: #0000ff;">:g</span> <span style="color: #008b8b;">:number</span> mapper (fn [m] <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">apply</span> + <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">vals</span> m<span style="color: #8c8c8c;">)))</span> telltale <span style="color: #8b2252;">":g values sum must be a number"</span><span style="color: #8c8c8c;">))</span>

<span style="color: #8c8c8c;">(</span>will-work 6 get-key-g-sum-vals test-map1<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
6
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Using a Monitor</h2>
<div class="outline-text-2" id="text-11">
<p>
A monitor provides a <span class="underline">hook</span> to call an arbitrary function in an accessor.
The result of a monitor is ignored.  Monitors can be used for any
purpose e.g. logging, diagnostics, communications with other
processes, whatever.
</p>

<p>
A monitor is specified using the <span class="underline">monitor</span> parameter.
</p>
</div>
