doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.org
** Example - a getter with a monitor

If provided, the monitor function in a getter is called with at least the following arguments:

1. the key name;

2. the key value (transformed if required); and 

3. the original (argument) map.

You can, optionally, add your own additional arguments using the
_monitor-args_ parameter, and these are passed "as-is"
to the monitor function after the other arguments.  The _monitor-args_ should
be a vector.

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - a getter with a monitor

;; This is the monitor function

(defn monitor-get-key-j
  [key-name key-value arg-map & opt-args]
  (println "monitor-get-key-j" "key-name" key-name "key-value" key-value "arg-map" arg-map "opt-args" (count opt-args) opt-args))

(def get-key-j (define-map-get-accessor :j :number monitor monitor-get-key-j monitor-args ["opt arg1" 2 :three]))

;; The getter works as usual

(will-work 456 get-key-j {:j 456})
;; =>
456
;; And should display the monitor message:
;; monitor-get-key-j key-name :j key-value 456 arg-map {:j 456} opt-args 3 (opt-arg1 2 :three)
#+end_src

** Example - a putter with a monitor

If provided, a putter's monitor function is called always with the following arguments:

1. the key name;

2. the key value (transformed if require); 

3. the original (argument) map; and 

4. the new (updated) map.

As with a getter, and optionally, you pass your own additional arguments using the
_monitor-args_ parameter.  

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - a putter with a monitor

;; This is the monitor function

(defn monitor-put-key-k
  [key-name key-value arg-map new-map]
  (println "monitor-put-key-k" "key-name" key-name "key-value" key-value "arg-map" arg-map "new-map" new-map))

(def put-key-k (define-map-put-accessor :k :string monitor monitor-put-key-k))

;; The putter works as usual

(will-work {:k "new value of key :k"} put-key-k {:k "old value of key :k"} "new value of key :k")
;; =>
{:k "new value of key :k"}
;; And should produce message like:
;; monitor-put-key-k key-name :j key-value 456 arg-map {:k "old value of key :k"} new-map {:k "new value of key :k"}
#+end_src


* Multi-Level Keys

You can also define accessors with multilevel keys and use (define) them in an equivalent way as when using
_get-in_ and _assoc-in_ directly by providing a vector containing the
key hierarchy in a call to e.g. _define-map_get_accessor_.

*** Example - Explicit Multi-Level Getters

In these getter examples the value of multilevel key _[:a :b :c]_ must be a string:

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - Explicit Multi-Level Getters

;; This example shows how to define a getter function that ensures the
;; returned value of multi-level key [:a :b :c] is a string. It also supplies a
;; static default.

(def get-key-abc (define-map-get-accessor [:a :b :c] :string default "static default for multilevel key [:a :b :c]" telltale "The value of multilevel key [:a :b :c] must be a string"))

(will-work "value for multilevel key [:a :b :c]" get-key-abc {:a {:b {:d 4 :c "value for multilevel key [:a :b :c]"}}})
;; =>
"value for multilevel key [:a :b :c]"

;; The below will fail as [:a :b :c] is not a string

(will-fail get-key-abc {:a {:b {:d "value of [:a :b :d]" :c 99}}})
;; => message something like
;; Contract Failure Value >class clojure.lang.PersistentArrayMap< >{:a {:b 99}}< KEY :a :b REASON The value of multilevel key [:a :b :c] must be a string

;; Static Defaults work as expected
(will-work "static default for multilevel key [:a :b :c]" get-key-abc {})
;; =>
"static default for multilevel key [:a :b :c]"

;; Dynnamic Defaults work as expected
(will-work "dynamic default for multilevel key [:a :b :c]" get-key-abc {} "dynamic default for multilevel key [:a :b :c]")
;; =>
"dynamic default for multilevel key [:a :b :c]"

;; This will also work because, although the map does not have enough levels, the static default will be returned

(will-work "static default for multilevel key [:a :b :c]" get-key-abc {:a {:b "value of b is not a map so key c can not exist"}})
;; =>
"static default for multilevel key [:a :b :c]"
#+end_src

