doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.html

<div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> Example - a getter with a monitor</h3>
<div class="outline-text-3" id="text-11-1">
<p>
If provided, the monitor function in a getter is called with at least the following arguments:
</p>

<ol class="org-ol">
<li>the key name;
</li>

<li>the key value (transformed if required); and 
</li>

<li>the original (argument) map.
</li>
</ol>

<p>
You can, optionally, add your own additional arguments using the
<span class="underline">monitor-args</span> parameter, and these are passed "as-is"
to the monitor function after the other arguments.  The <span class="underline">monitor-args</span> should
be a vector.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - a getter with a monitor</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This is the monitor function</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">monitor-get-key-j</span>
  [key-name key-value arg-map &amp; opt-args]
  <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">println</span> <span style="color: #8b2252;">"monitor-get-key-j"</span> <span style="color: #8b2252;">"key-name"</span> key-name <span style="color: #8b2252;">"key-value"</span> key-value <span style="color: #8b2252;">"arg-map"</span> arg-map <span style="color: #8b2252;">"opt-args"</span> <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">count</span> opt-args<span style="color: #8c8c8c;">)</span> opt-args<span style="color: #8c8c8c;">))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-j</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-get-accessor</span> <span style="color: #0000ff;">:j</span> <span style="color: #008b8b;">:number</span> monitor monitor-get-key-j monitor-args [<span style="color: #8b2252;">"opt arg1"</span> 2 <span style="color: #008b8b;">:three</span>]<span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">The getter works as usual</span>

<span style="color: #8c8c8c;">(</span>will-work 456 get-key-j {<span style="color: #008b8b;">:j</span> 456}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
456
<span style="color: #006400;">;; </span><span style="color: #006400;">And should display the monitor message:</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">monitor-get-key-j key-name :j key-value 456 arg-map {:j 456} opt-args 3 (opt-arg1 2 :three)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> Example - a putter with a monitor</h3>
<div class="outline-text-3" id="text-11-2">
<p>
If provided, a putter's monitor function is called always with the following arguments:
</p>

<ol class="org-ol">
<li>the key name;
</li>

<li>the key value (transformed if require); 
</li>

<li>the original (argument) map; and 
</li>

<li>the new (updated) map.
</li>
</ol>

<p>
As with a getter, and optionally, you pass your own additional arguments using the
<span class="underline">monitor-args</span> parameter.  
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - a putter with a monitor</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This is the monitor function</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">monitor-put-key-k</span>
  [key-name key-value arg-map new-map]
  <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">println</span> <span style="color: #8b2252;">"monitor-put-key-k"</span> <span style="color: #8b2252;">"key-name"</span> key-name <span style="color: #8b2252;">"key-value"</span> key-value <span style="color: #8b2252;">"arg-map"</span> arg-map <span style="color: #8b2252;">"new-map"</span> new-map<span style="color: #8c8c8c;">))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">put-key-k</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-put-accessor</span> <span style="color: #0000ff;">:k</span> <span style="color: #008b8b;">:string</span> monitor monitor-put-key-k<span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">The putter works as usual</span>

<span style="color: #8c8c8c;">(</span>will-work {<span style="color: #008b8b;">:k</span> <span style="color: #8b2252;">"new value of key :k"</span>} put-key-k {<span style="color: #008b8b;">:k</span> <span style="color: #8b2252;">"old value of key :k"</span>} <span style="color: #8b2252;">"new value of key :k"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
{<span style="color: #008b8b;">:k</span> <span style="color: #8b2252;">"new value of key :k"</span>}
<span style="color: #006400;">;; </span><span style="color: #006400;">And should produce message like:</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">monitor-put-key-k key-name :j key-value 456 arg-map {:k "old value of key :k"} new-map {:k "new value of key :k"}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Multi-Level Keys</h2>
<div class="outline-text-2" id="text-12">
<p>
You can also define accessors with multilevel keys and use (define) them in an equivalent way as when using
<span class="underline">get-in</span> and <span class="underline">assoc-in</span> directly by providing a vector containing the
key hierarchy in a call to e.g. <span class="underline">define-map_get_accessor</span>.
</p>
</div>

<div id="outline-container-sec-12-0-1" class="outline-4">
<h4 id="sec-12-0-1"><span class="section-number-4">12.0.1</span> Example - Explicit Multi-Level Getters</h4>
<div class="outline-text-4" id="text-12-0-1">
<p>
In these getter examples the value of multilevel key <span class="underline">[:a :b :c]</span> must be a string:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - Explicit Multi-Level Getters</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This example shows how to define a getter function that ensures the</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">returned value of multi-level key [:a :b :c] is a string. It also supplies a</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">static default.</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-abc</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-get-accessor</span> [<span style="color: #008b8b;">:a</span> <span style="color: #008b8b;">:b</span> <span style="color: #008b8b;">:c</span>] <span style="color: #008b8b;">:string</span> default <span style="color: #8b2252;">"static default for multilevel key [:a :b :c]"</span> telltale <span style="color: #8b2252;">"The value of multilevel key [:a :b :c] must be a string"</span><span style="color: #8c8c8c;">))</span>

<span style="color: #8c8c8c;">(</span>will-work <span style="color: #8b2252;">"value for multilevel key [:a :b :c]"</span> get-key-abc {<span style="color: #008b8b;">:a</span> {<span style="color: #008b8b;">:b</span> {<span style="color: #008b8b;">:d</span> 4 <span style="color: #008b8b;">:c</span> <span style="color: #8b2252;">"value for multilevel key [:a :b :c]"</span>}}}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
<span style="color: #8b2252;">"value for multilevel key [:a :b :c]"</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">The below will fail as [:a :b :c] is not a string</span>

<span style="color: #8c8c8c;">(</span>will-fail get-key-abc {<span style="color: #008b8b;">:a</span> {<span style="color: #008b8b;">:b</span> {<span style="color: #008b8b;">:d</span> <span style="color: #8b2252;">"value of [:a :b :d]"</span> <span style="color: #008b8b;">:c</span> 99}}}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt; message something like</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">Contract Failure Value &gt;class clojure.lang.PersistentArrayMap&lt; &gt;{:a {:b 99}}&lt; KEY :a :b REASON The value of multilevel key [:a :b :c] must be a string</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Static Defaults work as expected</span>
<span style="color: #8c8c8c;">(</span>will-work <span style="color: #8b2252;">"static default for multilevel key [:a :b :c]"</span> get-key-abc {}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
<span style="color: #8b2252;">"static default for multilevel key [:a :b :c]"</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Dynnamic Defaults work as expected</span>
<span style="color: #8c8c8c;">(</span>will-work <span style="color: #8b2252;">"dynamic default for multilevel key [:a :b :c]"</span> get-key-abc {} <span style="color: #8b2252;">"dynamic default for multilevel key [:a :b :c]"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
<span style="color: #8b2252;">"dynamic default for multilevel key [:a :b :c]"</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This will also work because, although the map does not have enough levels, the static default will be returned</span>

<span style="color: #8c8c8c;">(</span>will-work <span style="color: #8b2252;">"static default for multilevel key [:a :b :c]"</span> get-key-abc {<span style="color: #008b8b;">:a</span> {<span style="color: #008b8b;">:b</span> <span style="color: #8b2252;">"value of b is not a map so key c can not exist"</span>}}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
<span style="color: #8b2252;">"static default for multilevel key [:a :b :c]"</span>
</pre>
</div>
</div>
</div>
