doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.org
*** Example - Explicit Multi-Level Putters

Multilevel putters works equivalently.

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - Explicit Multi-Level Putters

;; This example shows how to define a putter function for the string multilevel key [:a :b]:
 
(def put-key-ab (define-map-put-accessor [:a :b] :string telltale "The value of multilevel key [:a :b] must be a string"))

(will-work {:a {:b "cd"}}  put-key-ab {:a {:b "ab"}} "cd") 
;; =>
{:a {:b "cd"}}

;; The below will fail as [:a :b] is not a string

(will-fail put-key-ab {:a {:b "ab"}} 99)
;; => message something like
;; Contract Failure Value >class clojure.lang.PersistentArrayMap< >{:a {:b "ab"}}< KEY :a :b REASON The value of multilevel key [:a :b] must be a string
#+end_src


* Composing Multi-Level Accessors

You might find it useful to be able to *compose* a (new) accessor
using an existing one.

For example you may want to define a "leaf" accessor for a key at the
lowest level and then compose the leaf accessor with keys from the
other, higher levels.  The point being that if the leaf key is used in more
than one multilevel map, the leaf accessor only has to be defined
once.

Your can also e.g. use a mapper with a composed accessor and enforce a different contract on the
mapped (derived) key value.  In the example below the composed accessor
_get-key-z-from-pq_ defines a mapper to count the characters in the
expected string and applies a _:number_ contract to the mapped value.
The leaf accessor _get-key-z_ ensures the value fed into
the mapper is a _:string_. (Note you can't use a dynamic default in
this case because the _:number_ contract will fail a _:string_
supplied as the dynamic default.)

*** Example - composing a getter

In this example the leaf accessor is for key _:z_.  

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - composing a getter

;; Define the leaf accessor for key :z

(def get-key-z (define-map-get-accessor :z :string default "static default for key :z" telltale "The value of :z must be a string"))

;; Compose the leaf with a keys [:a :b]

(def get-key-z-from-ab (compose-map-get-accessor [:a :b] get-key-z))

;; This will work

(will-work "multilevel key [:a :b :z] value" get-key-z-from-ab {:a {:b {:d 4 :z "multilevel key [:a :b :z] value"}}})
;; =>
"multilevel key [:a :b :z] value"

;; The below will fail as [:a :b :z] is not a string

(will-fail get-key-z-from-ab {:a {:b {:d "value of [:a :b :d]" :z 99}}})

;; Defaults are hierachical and the "leafiest" one wins

(will-work "static default for key :z" get-key-z-from-ab {})
;; =>
"static default for key :z"

(will-work "dynamic default for key :z" get-key-z-from-ab {} "dynamic default for key :z")
;; =>
"dynamic default for key :z"

;; Compose the leaf with keys [:p :q] *and* use a mapper to return a number

(def get-key-z-from-pq (compose-map-get-accessor [:p :q] get-key-z  mapper (fn [x] (count x)) key-contract :number))

(will-work 20 get-key-z-from-pq {:p {:q {:z "a string of 20 chars"}}} )
;; =>
20
#+end_src
    
Finally, there is no actual restriction on leaf accessors being for just one level; they can
be multilevel.


* Defining both putter and getter 

The definitions of a getter and putter for the same key share common
arguments and its likely both accessors would be required. As a
convenience, you can define both the putter and getter in one call
to the _define-map-accessors_ macro.

The base name of the accessors can be supplied using the optional
_name_ argument and the getter and putter names are generated from it.
For example if _name_ is _the-v-key_ then the putter name will be
_put-the-v-key_ and the getter _get-the-v-key_. The value of _name_
can be anything, it is "stringified" (using _str_) as necessary.

Alternatively, you can explicitly specify the names of each accessor
using the _get-name_ and _put-name_ parameters respectively.  These
take priority over _name_.

If no _name_, _get-name_ or _put-name_ parameters are provided, the
name will be derived from the name of the key. So if the key's name is
_:x_, the accessors will be _get-x_ and _put-x_.

Other, accessor-specific parameters can be provided using the regular
parameter (e.g. _telltale_  _monitor_ _mapper_ etc) prefixed by _get-_ or _put-_.

