doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.html
<div id="outline-container-sec-12-0-2" class="outline-4">
<h4 id="sec-12-0-2"><span class="section-number-4">12.0.2</span> Example - Explicit Multi-Level Putters</h4>
<div class="outline-text-4" id="text-12-0-2">
<p>
Multilevel putters works equivalently.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - Explicit Multi-Level Putters</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This example shows how to define a putter function for the string multilevel key [:a :b]:</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">put-key-ab</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-put-accessor</span> [<span style="color: #008b8b;">:a</span> <span style="color: #008b8b;">:b</span>] <span style="color: #008b8b;">:string</span> telltale <span style="color: #8b2252;">"The value of multilevel key [:a :b] must be a string"</span><span style="color: #8c8c8c;">))</span>

<span style="color: #8c8c8c;">(</span>will-work {<span style="color: #008b8b;">:a</span> {<span style="color: #008b8b;">:b</span> <span style="color: #8b2252;">"cd"</span>}}  put-key-ab {<span style="color: #008b8b;">:a</span> {<span style="color: #008b8b;">:b</span> <span style="color: #8b2252;">"ab"</span>}} <span style="color: #8b2252;">"cd"</span><span style="color: #8c8c8c;">)</span> 
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
{<span style="color: #008b8b;">:a</span> {<span style="color: #008b8b;">:b</span> <span style="color: #8b2252;">"cd"</span>}}

<span style="color: #006400;">;; </span><span style="color: #006400;">The below will fail as [:a :b] is not a string</span>

<span style="color: #8c8c8c;">(</span>will-fail put-key-ab {<span style="color: #008b8b;">:a</span> {<span style="color: #008b8b;">:b</span> <span style="color: #8b2252;">"ab"</span>}} 99<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt; message something like</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">Contract Failure Value &gt;class clojure.lang.PersistentArrayMap&lt; &gt;{:a {:b "ab"}}&lt; KEY :a :b REASON The value of multilevel key [:a :b] must be a string</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Composing Multi-Level Accessors</h2>
<div class="outline-text-2" id="text-13">
<p>
You might find it useful to be able to <b>compose</b> an (new) accessor
using an existing accessor.
</p>

<p>
For example you may want to define a "leaf" accessor for a key at the
lowest level and then compose the leaf accessor with keys from the
other, higher levels.  The point being that if the leaf key is used in more
than one multilevel map, the leaf accessor only has to be defined
once.
</p>

<p>
Your can also e.g. use a mapper with a composed accessor and enforce a different contract on the
mapped (derived) key value.  In the example below the composed accessor
<span class="underline">get-key-z-from-pq</span> defines a mapper to count the characters in the
expected string and applies a <span class="underline">:number</span> contract to the mapped value.
The leaf accessor <span class="underline">get-key-z</span> ensures the value fed into
the mapper is a <span class="underline">:string</span>. (Note you can't use a dynamic default in
this case because the <span class="underline">:number</span> contract will fail a <span class="underline">:string</span>
supplied as the dynamic default.)
</p>
</div>

<div id="outline-container-sec-13-0-1" class="outline-4">
<h4 id="sec-13-0-1"><span class="section-number-4">13.0.1</span> Example - composing a getter</h4>
<div class="outline-text-4" id="text-13-0-1">
<p>
In this example the leaf accessor is for key <span class="underline">:z</span>.  
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - composing a getter</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Define the leaf accessor for key :z</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-z</span> <span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-get-accessor</span> <span style="color: #0000ff;">:z</span> <span style="color: #008b8b;">:string</span> default <span style="color: #8b2252;">"static default for key :z"</span> telltale <span style="color: #8b2252;">"The value of :z must be a string"</span><span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Compose the leaf with a keys [:a :b]</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-z-from-ab</span> <span style="color: #8c8c8c;">(</span>compose-map-get-accessor [<span style="color: #008b8b;">:a</span> <span style="color: #008b8b;">:b</span>] get-key-z<span style="color: #8c8c8c;">))</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This will work</span>

<span style="color: #8c8c8c;">(</span>will-work <span style="color: #8b2252;">"multilevel key [:a :b :z] value"</span> get-key-z-from-ab {<span style="color: #008b8b;">:a</span> {<span style="color: #008b8b;">:b</span> {<span style="color: #008b8b;">:d</span> 4 <span style="color: #008b8b;">:z</span> <span style="color: #8b2252;">"multilevel key [:a :b :z] value"</span>}}}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
<span style="color: #8b2252;">"multilevel key [:a :b :z] value"</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">The below will fail as [:a :b :z] is not a string</span>

<span style="color: #8c8c8c;">(</span>will-fail get-key-z-from-ab {<span style="color: #008b8b;">:a</span> {<span style="color: #008b8b;">:b</span> {<span style="color: #008b8b;">:d</span> <span style="color: #8b2252;">"value of [:a :b :d]"</span> <span style="color: #008b8b;">:z</span> 99}}}<span style="color: #8c8c8c;">)</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Defaults are hierachical and the "leafiest" one wins</span>

<span style="color: #8c8c8c;">(</span>will-work <span style="color: #8b2252;">"static default for key :z"</span> get-key-z-from-ab {}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
<span style="color: #8b2252;">"static default for key :z"</span>

<span style="color: #8c8c8c;">(</span>will-work <span style="color: #8b2252;">"dynamic default for key :z"</span> get-key-z-from-ab {} <span style="color: #8b2252;">"dynamic default for key :z"</span><span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
<span style="color: #8b2252;">"dynamic default for key :z"</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Compose the leaf with keys [:p :q] *and* use a mapper to return a number</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">get-key-z-from-pq</span> <span style="color: #8c8c8c;">(</span>compose-map-get-accessor [<span style="color: #008b8b;">:p</span> <span style="color: #008b8b;">:q</span>] get-key-z  mapper (fn [x] <span style="color: #8c8c8c;">(</span><span style="color: #483d8b;">count</span> x<span style="color: #8c8c8c;">))</span> key-contract <span style="color: #008b8b;">:number</span><span style="color: #8c8c8c;">))</span>

<span style="color: #8c8c8c;">(</span>will-work 20 get-key-z-from-pq {<span style="color: #008b8b;">:p</span> {<span style="color: #008b8b;">:q</span> {<span style="color: #008b8b;">:z</span> <span style="color: #8b2252;">"a string of 20 chars"</span>}}} <span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
20
</pre>
</div>

<p>
Finally, there is no actual restriction on leaf accessors being for just one level; they can
be multilevel.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Defining both putter and getter</h2>
<div class="outline-text-2" id="text-14">
<p>
The definitions of a getter and putter for the same key share common
arguments and its likely both accessors would be required. As a
convenience, you can define both the putter and getter in one call
to the <span class="underline">define-map-accessors</span> macro.
</p>

<p>
The base name of the accessors can be supplied using the optional
<span class="underline">name</span> argument and the getter and putter names are generated from it.
For example if <span class="underline">name</span> is <span class="underline">the-v-key</span> then the putter name will be
<span class="underline">put-the-v-key</span> and the getter <span class="underline">get-the-v-key</span>. The value of <span class="underline">name</span>
can be anything, it is "stringified" (using <span class="underline">str</span>) as necessary.
</p>

<p>
Alternatively, you can explicitly specify the names of each accessor
using the <span class="underline">get-name</span> and <span class="underline">put-name</span> parameters respectively.  These
take priority over <span class="underline">name</span>.
</p>

<p>
If no <span class="underline">name</span>, <span class="underline">get-name</span> or <span class="underline">put-name</span> parameters are provided, the
name will be derived from the name of the key. So if the key's name is
<span class="underline">:x</span>, the accessors will be <span class="underline">get-x</span> and <span class="underline">put-x</span>.
</p>

<p>
Other, accessor-specific parameters can be provided using the regular
parameter (e.g. <span class="underline">telltale</span>  <span class="underline">monitor</span> <span class="underline">mapper</span> etc) prefixed by <span class="underline">get-</span> or <span class="underline">put-</span>.
</p>
</div>
