doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.org
*** Example - defining both accessors together

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - defining both accessors together

;; The base name of the accessors has been provided: "the-v-key"

(define-map-accessors :v is-map-with-keyword-keys-and-numeric-values? name the-v-key telltale ":p failed predicate is-map-with-keyword-keys-and-numeric-values?")

;; This getter will work

(will-work {:a 1 :b 2 :c 3} get-the-v-key {:v {:a 1 :b 2 :c 3}})
;; =>
{:a 1 :b 2 :c 3}

;; But this will fail as expected

(will-fail get-the-v-key {:v {"x" 1 "y" 2 "z" 3}})

;; This putter will work

(will-work {:v {:a 1 :b 2 :c 3}} put-the-v-key {} {:a 1 :b 2 :c 3})
;; =>
{:v {:a 1 :b 2 :c 3}}
#+end_src

*** Example - defining both accessors using the key's name to name the accessors

#+begin_src clojure :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Example - defining both accessors using the key's name to name the accessors

;; Note since no name parameters have been provided, the getter and
;; putter will derived from the key's name and be called get-x and put-x respectively.

(define-map-accessors :x is-map-with-keyword-keys-and-numeric-values?
  get-telltale "the value of :x or a default was not a map with keyword keys and numeric values"
  put-telltale "the new value of :x must be a map with keyword keys and numeric values"
  )

;; This getter will work

(will-work {:a 1 :b 2 :c 3} get-x {:x {:a 1 :b 2 :c 3}})
;; =>
{:a 1 :b 2 :c 3}

;; But this will fail as expected

(will-fail get-x {:x {"x" 1 "y" 2 "z" 3}})

;; This putter will work

(will-work {:x {:a 1 :b 2 :c 3}} put-x {} {:a 1 :b 2 :c 3})
;; =>
{:x {:a 1 :b 2 :c 3}}
#+end_src


* Final Words

[clojure-contracts-maps][ClojureMapAccessorsGithub] provides a useful
additional feature layer sitting atop normal [Clojure][ClojureHome]
maps.

Using the library, its possible to apply Clojure's [pre and post conditions][FogusBlogClojurePreAndPost] to a map's key accesses in the
same way as they can be applied to a function's arguments. The power
of [clojure-contracts-sugar][ClojureContractsSugarGithub] (and
implicitly [core.contracts][ClojureCoreContractsGithub]) allows for a
very rich sets of constraints to be applied to a key's value.

The opportunity to define the access "semantics" of a map's key via
regular functions, ensuring the semantics are adhered to and/or applied
consistently, is a useful and easy-to-use program-correctness aid.

Using _mappers_ with a _getter_ provide a simple way of generating
_views_ of a key's value, without affecting the original value.
Conversely,  _mappers_ with a _putter_ facilitate e.g _normalising_ the
key's (new) value before storing in the (updated) map.

_Monitors_ provide a simple way of adding arbitrary, but neutral
non-affecting logic, to the key's access. And a _telltale_ helps pin
down where things went wrong.


