doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.html

<div id="outline-container-sec-14-0-1" class="outline-4">
<h4 id="sec-14-0-1"><span class="section-number-4">14.0.1</span> Example - defining both accessors together</h4>
<div class="outline-text-4" id="text-14-0-1">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - defining both accessors together</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">The base name of the accessors has been provided: "the-v-key"</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-accessors</span> <span style="color: #0000ff;">:v</span> is-map-with-keyword-keys-and-numeric-values? name the-v-key telltale <span style="color: #8b2252;">":p failed predicate is-map-with-keyword-keys-and-numeric-values?"</span><span style="color: #8c8c8c;">)</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This getter will work</span>

<span style="color: #8c8c8c;">(</span>will-work {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3} get-the-v-key {<span style="color: #008b8b;">:v</span> {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
{<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}

<span style="color: #006400;">;; </span><span style="color: #006400;">But this will fail as expected</span>

<span style="color: #8c8c8c;">(</span>will-fail get-the-v-key {<span style="color: #008b8b;">:v</span> {<span style="color: #8b2252;">"x"</span> 1 <span style="color: #8b2252;">"y"</span> 2 <span style="color: #8b2252;">"z"</span> 3}}<span style="color: #8c8c8c;">)</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This putter will work</span>

<span style="color: #8c8c8c;">(</span>will-work {<span style="color: #008b8b;">:v</span> {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}} put-the-v-key {} {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
{<span style="color: #008b8b;">:v</span> {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-14-0-2" class="outline-4">
<h4 id="sec-14-0-2"><span class="section-number-4">14.0.2</span> Example - defining both accessors using the key's name to name the accessors</h4>
<div class="outline-text-4" id="text-14-0-2">
<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #006400;">;; </span><span style="color: #006400;">Example - defining both accessors using the key's name to name the accessors</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">Note since no name parameters have been provided, the getter and</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">putter will derived from the key's name and be called get-x and put-x respectively.</span>

<span style="color: #8c8c8c;">(</span><span style="color: #a020f0;">define-map-accessors</span> <span style="color: #0000ff;">:x</span> is-map-with-keyword-keys-and-numeric-values?
  get-telltale <span style="color: #8b2252;">"the value of :x or a default was not a map with keyword keys and numeric values"</span>
  put-telltale <span style="color: #8b2252;">"the new value of :x must be a map with keyword keys and numeric values"</span>
  <span style="color: #8c8c8c;">)</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This getter will work</span>

<span style="color: #8c8c8c;">(</span>will-work {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3} get-x {<span style="color: #008b8b;">:x</span> {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
{<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}

<span style="color: #006400;">;; </span><span style="color: #006400;">But this will fail as expected</span>

<span style="color: #8c8c8c;">(</span>will-fail get-x {<span style="color: #008b8b;">:x</span> {<span style="color: #8b2252;">"x"</span> 1 <span style="color: #8b2252;">"y"</span> 2 <span style="color: #8b2252;">"z"</span> 3}}<span style="color: #8c8c8c;">)</span>

<span style="color: #006400;">;; </span><span style="color: #006400;">This putter will work</span>

<span style="color: #8c8c8c;">(</span>will-work {<span style="color: #008b8b;">:x</span> {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}} put-x {} {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}<span style="color: #8c8c8c;">)</span>
<span style="color: #006400;">;; </span><span style="color: #006400;">=&gt;</span>
{<span style="color: #008b8b;">:x</span> {<span style="color: #008b8b;">:a</span> 1 <span style="color: #008b8b;">:b</span> 2 <span style="color: #008b8b;">:c</span> 3}}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> Final Words</h2>
<div class="outline-text-2" id="text-15">
<p>
[clojure-contracts-maps][ClojureMapAccessorsGithub] provides a useful
additional feature layer sitting atop normal [Clojure][ClojureHome]
maps.
</p>

<p>
Using the library, its possible to apply Clojure's [:pre and :post
conditions][FogusBlogClojurePreAndPost] to a map's key accesses in the
same way as they can be applied to a function's arguments. The power
of [clojure-contracts-sugar][ClojureContractsSugarGithub] (and
implicitly [core.contracts][ClojureCoreContractsGithub]) allows for a
very rich sets of constraints to be applied to a key's value.
</p>

<p>
The opportunity to define the access "semantics" of a map's key via
regular functions, ensuring the semantics are adhered to and/or applied
consistently, is a useful and easy-to-use program-correctness aid.
</p>

<p>
Using <span class="underline">mappers</span> with a <span class="underline">getter</span> provide a simple way of generating
<span class="underline">views</span> of a key's value, without affecting the original value.
Conversely,  <span class="underline">mappers</span> with a <span class="underline">putter</span> facilitate e.g <span class="underline">normalising</span> the
key's (new) value before storing in the (updated) map.
</p>

<p>
<span class="underline">Monitors</span> provide a simple way of adding arbitrary, but neutral
non-affecting logic, to the key's access.
</p>
</div>
</div>
