doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.org
* Final, Final Words

I've done a fair amount of Ruby meta programming.  An essential difference is
[Clojure][ClojureHome] macros are compile-time whereas Ruby is
run-time.

But doing macro metaprogramming feels quite different:
[Clojure][ClojureHome] works with values ([homoiconicity][HomoiconicityWikipedia])
whereas Ruby metaprogramming works with text that is eval-ed.   

One of the most noticeable differences I've found though (maybe just my
style) is whereas in Ruby you build the complete code-as-text, with
macros you can take an iterative approach i.e a top level macro
returns one or more "calls" to lower
level more-focused macros.

There does seem to be a bit of a meme in the community along the lines of "If you are
using a macro you are doing it wrong".  But, used wisely, macros are a
fantastic (and sometimes essential) tool.

But the objectives are the same whether Ruby or Clojure - removing boilerplate and getting
to the heart of the problem rather than distracted by implementation details.

#+BEGIN_SRC clojure  :exports none :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; Close the wrapper
)
#+end_src

#+BEGIN_SRC clojure :exports none :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
;; prevent an error from lein run
(defn -main
  [& args]
  ;;(profiling/profile :info :Arithmetic (dotimes [n 1] (run-all-tests args)))
  (dotimes [n 1] (run-all-tests args)))
#+END_SRC

# #+BEGIN_SRC clojure :exports none :tangle ../examples/map-examples/src/main/clojure/map_examples1.clj
# (defn -main [& args])
# #+END_SRC

#+BEGIN_SRC clojure :mkdirp yes  :exports none :tangle ../examples/map-examples/project.clj
(defproject map-examples1 "0.1.0"
  :description "Some examples of applying contracts to Clojure maps"
  :url "https://github.com/ianrumford/clojure-contracts-maps"
  :license {:name "MIT" :url "http://opensource.org/licenses/MIT"}
  :dependencies [[org.clojure/clojure "1.5.1"]
                 [name.rumford/clojure-contracts-sugar "0.2.0"]
                 [name.rumford/clojure-contracts-maps "0.1.0"]]
  :source-paths ["src/main/clojure"]
  :test-paths   ["src/test/clojure"])
#+END_SRC

#+BEGIN_SRC
[ClojureHome]: http:///clojure.org
[JavaHome]: http://www.java.com
[LeiningenHome]: http://leiningen.org/
[LeiningenGithub]: https://github.com/technomancy/leiningen
[MavenHome]: http://maven.apache.org/
[ClojarsHome]: http://clojars.org
[ClojarsClojureContractsMaps]: https://clojars.org/name.rumford/clojure-contracts-maps
[ClojureCoreContractsGithub]: https://github.com/clojure/core.contracts
[ClojureContractsSugarGithub]: https://github.com/ianrumford/clojure-contracts-sugar
[ClojureMapAccessorsGithub]: https://github.com/ianrumford/clojure-contracts-maps
[ClojureCoreContractsPostFirstTake]: http://ianrumford.github.io/blog/2012/11/17/first-take-on-contracts-in-clojure/
[FogusBlogClojurePreAndPost]: http://blog.fogus.me/2009/12/21/clojures-pre-and-post/
[EmerickHome]: http://cemerick.com/
[GrandHome]: http://clj-me.cgrand.net/
[CarperHome]: http://briancarper.net/
[ClojureProgrammingBook]: http://www.clojurebook.com/
[FogusHome]: http://blog.fogus.me
[FogusTwitter]: https://twitter.com/fogus
[CHouserHome]: http://old.n01se.net/chouser
[BookJoC2ed]: http://www.manning.com/fogus2
[RumfordBlogClojureContractsSugar]: http://ianrumford.github.io/blog/2014/02/19/a-little-sugar-with-your-clojure-aspect-contracts/
[RumfordBlogClojureContractsFirstTake]: http://ianrumford.github.io/blog/2012/11/17/first-take-on-contracts-in-clojure/
[emacshome]: http://www.gnu.org/software/emacs/
[orgmodehome]: http://orgmode.org/
[orgmodemanualextractsourcecode]: http://orgmode.org/org.html#Extracting-source-code
[PerlisTuringAward]: http://amturing.acm.org/award_winners/perlis_0132439.cfm
[HashWikipedia]: http://en.wikipedia.org/wiki/Hash_table
[CormenBookIntroductionToAlgorithms]: http://www.amazon.co.uk/Introduction-Algorithms-Thomas-H-Cormen/dp/0262032937/ref=sr_1_1?s=books&ie=UTF8&qid=1392992028&sr=1-1&keywords=0262032937
[CormenBookIntroductionToAlgorithmLuhn]: http://books.google.co.uk/books?id=NLngYyWFl_YC&pg=PA252&lpg=PA252&dq=luhn+hash+tables&source=bl&ots=BxWoJG3mJa&sig=cTpYRKlO-rNe8TDar3ko8bv4MQ8&hl=en&sa=X&ei=0UIHU662DKap7Abp1IHgCA&ved=0CFoQ6AEwBg#v=onepage&q=luhn%20hash%20tables&f=false
[LuhnWikipedia]: http://en.wikipedia.org/wiki/Hans_Peter_Luhn
[JavaWikiHashmap]: http://docs.oracle.com/javase/7/docs/api/java/util/HashMap.html
[HigherOrderFunctionWikipedia]: http://en.wikipedia.org/wiki/Higher-order_function
[Eiffel Design by Contract]: http://en.wikipedia.org/wiki/Eiffel_(programming_language)#Design_by_Contract
[ClojureDocsAssert]: http://clojuredocs.org/clojure_core/clojure.core/assert
[ClojureDocsComp]: http://clojuredocs.org/clojure_core/clojure.core/comp
[HomoiconicityWikipedia]: http://en.wikipedia.org/wiki/Homoiconicity
#+END_SRC
