doc/2014-03-19-two-sugars-with-your-contracts-for-clojure-maps.html
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> Final, Final Words</h2>
<div class="outline-text-2" id="text-16">
<p>
I've done a fair amount of Ruby meta programming.  An essential difference is
[Clojure][ClojureHome] macros are compile-time whereas Ruby is
run-time.
</p>

<p>
But doing macro metaprogramming feels quite different:
[Clojure][ClojureHome] works with values ([homoiconicity][HomoiconicityWikipedia])
whereas Ruby metaprogramming works with text that is eval-ed.   
</p>

<p>
One of the most noticeable different I've found though (maybe just my
style) is whereas in Ruby you build the complete code-as-text but with
macros you can take an iterative approach i.e a top level macro "call" lower
level more-focused macros.
</p>

<p>
There does seem to be a bit of a meme in the community along the lines of "If you are
using a macro you are doing it wrong".  But, used wisely, macros are a
fantastic (and sometimes essential) tool.
</p>

<p>
But the objectives are the same whether Ruby or Clojure - removing boilerplate and getting
to the heart of the problem rather than distracted by implementation details.
</p>

<pre class="example">
[ClojureHome]: http:///clojure.org
[JavaHome]: http://www.java.com
[LeiningenHome]: http://leiningen.org/
[LeiningenGithub]: https://github.com/technomancy/leiningen
[MavenHome]: http://maven.apache.org/
[ClojarsHome]: http://clojars.org
[ClojarsClojureContractsMaps]: https://clojars.org/name.rumford/clojure-contracts-maps
[ClojureCoreContractsGithub]: https://github.com/clojure/core.contracts
[ClojureContractsSugarGithub]: https://github.com/ianrumford/clojure-contracts-sugar
[ClojureMapAccessorsGithub]: https://github.com/ianrumford/clojure-contracts-maps
[ClojureCoreContractsPostFirstTake]: http://ianrumford.github.io/blog/2012/11/17/first-take-on-contracts-in-clojure/
[FogusBlogClojurePreAndPost]: http://blog.fogus.me/2009/12/21/clojures-pre-and-post/
[EmerickHome]: http://cemerick.com/
[GrandHome]: http://clj-me.cgrand.net/
[CarperHome]: http://briancarper.net/
[ClojureProgrammingBook]: http://www.clojurebook.com/
[FogusHome]: http://blog.fogus.me
[FogusTwitter]: https://twitter.com/fogus
[CHouserHome]: http://old.n01se.net/chouser
[BookJoC2ed]: http://www.manning.com/fogus2
[RumfordBlogClojureContractsSugar]: http://ianrumford.github.io/blog/2014/02/19/a-little-sugar-with-your-clojure-aspect-contracts/
[RumfordBlogClojureContractsFirstTake]: http://ianrumford.github.io/blog/2012/11/17/first-take-on-contracts-in-clojure/
[emacshome]: http://www.gnu.org/software/emacs/
[orgmodehome]: http://orgmode.org/
[orgmodemanualextractsourcecode]: http://orgmode.org/org.html#Extracting-source-code
[PerlisTuringAward]: http://amturing.acm.org/award_winners/perlis_0132439.cfm
[HashWikipedia]: http://en.wikipedia.org/wiki/Hash_table
[CormenBookIntroductionToAlgorithms]: http://www.amazon.co.uk/Introduction-Algorithms-Thomas-H-Cormen/dp/0262032937/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1392992028&amp;sr=1-1&amp;keywords=0262032937
[CormenBookIntroductionToAlgorithmLuhn]: http://books.google.co.uk/books?id=NLngYyWFl_YC&amp;pg=PA252&amp;lpg=PA252&amp;dq=luhn+hash+tables&amp;source=bl&amp;ots=BxWoJG3mJa&amp;sig=cTpYRKlO-rNe8TDar3ko8bv4MQ8&amp;hl=en&amp;sa=X&amp;ei=0UIHU662DKap7Abp1IHgCA&amp;ved=0CFoQ6AEwBg#v=onepage&amp;q=luhn%20hash%20tables&amp;f=false
[LuhnWikipedia]: http://en.wikipedia.org/wiki/Hans_Peter_Luhn
[JavaWikiHashmap]: http://docs.oracle.com/javase/7/docs/api/java/util/HashMap.html
[HigherOrderFunctionWikipedia]: http://en.wikipedia.org/wiki/Higher-order_function
[Eiffel Design by Contract]: http://en.wikipedia.org/wiki/Eiffel_(programming_language)#Design_by_Contract
[ClojureDocsAssert]: http://clojuredocs.org/clojure_core/clojure.core/assert
[HomoiconicityWikipedia]: http://en.wikipedia.org/wiki/Homoiconicity
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ian Rumford</p>
<p class="date">Created: 2014-03-19 Wed 17:52</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
